{"w2i": {"<pad>": 0, "<unk>": 1, "<sos>": 2, "<eos>": 3, "\n": 4, "": 5, "BasicGame": 6, "square_size=25": 7, "    ": 8, "SpriteSet": 9, "        ": 10, "floor": 11, ">": 12, "Immovable": 13, "img=oryx/backGrey": 14, "enemyground": 15, "img=newset/water": 16, "avatar": 17, " ": 18, "color=YELLOW": 19, "img=oryx/spaceship1": 20, "speed=0.15": 21, "powerblib": 22, "Passive": 23, "img=oryx/diamond3": 24, "powerblibturning": 25, "Flicker": 26, "blib": 27, "img=oryx/diamond1": 28, "enemy": 29, "Missile": 30, "cooldown=3": 31, "            ": 32, "orientation=RIGHT": 33, "orientation=LEFT": 34, "shrinkfactor=0.7": 35, "orientation=UP": 36, "orientation=DOWN": 37, "img=oryx/firedown1": 38, "Resource": 39, "color=GREEN": 40, "value=0": 41, "img=oryx/diamond2": 42, "wall": 43, "img=oryx/wall3": 44, "autotiling=True": 45, "LevelMapping": 46, "b": 47, "p": 48, "2": 49, "1": 50, ".": 51, "w": 52, "+": 53, "A": 54, "TerminationSet": 55, "SpriteCounter": 56, "     ": 57, "stype=avatar": 58, "              ": 59, "limit=0": 60, "win=False": 61, "MultiSpriteCounter": 62, "win=True": 63, "InteractionSet": 64, "killSprite": 65, "scoreChange=-10": 66, "scoreChange=1": 67, "spawnIfHasMore": 68, "limit=2": 69, "spawn": 70, "changeResource": 71, "reverseDirection": 72, "  ": 73, "img=oryx/backBlack": 74, "city": 75, "explosion": 76, "limit=5": 77, "img=oryx/circleEffect1": 78, "shrinkfactor=0.5": 79, "movable": 80, "      ": 81, "ShootAvatar": 82, "Chaser": 83, "stype=city": 84, "color=ORANGE": 85, "speed=0.1": 86, "speed=0.3": 87, "img=newset/block2": 88, "c": 89, "m": 90, "f": 91, "stepBack": 92, "killBoth": 93, "scoreChange=-1": 94, "scoreChange=2": 95, "img=oryx/backOBrown": 96, "marsh": 97, "color=BROWN": 98, "img=oryx/grass": 99, "color=RED": 100, "color=GRAY": 101, "shrinkfactor=0.75": 102, "Bomber": 103, "prob=0.05": 104, "cooldown=2": 105, "zombie": 106, "goal": 107, "Door": 108, "SpawnPoint": 109, "portal=True": 110, "prob=0.01": 111, "shovel": 112, "OrientedFlicker": 113, "color=LIGHTGRAY": 114, "stype=shovel": 115, "img=oryx/wall6": 116, "transformTo": 117, "killSecond=True": 118, "EOS": 119, "g": 120, "h": 121, "z": 122, "x": 123, "t": 124, "Timeout": 125, "limit=1000": 126, "limit=1": 127, "key_handler=Pulse": 128, "water": 129, "color=BLUE": 130, "weaponToggle1": 131, "shrinkfactor=0.6": 132, "weaponToggle2": 133, "weapon": 134, "key": 135, "shrinkfactor=0.8": 136, "img=oryx/key2": 137, "lock": 138, "img=oryx/doorclosed1": 139, "portalentry": 140, "Portal": 141, "color=LIGHTBLUE": 142, "portalexit": 143, "img=oryx/door2": 144, "missile": 145, "speed=0.5": 146, "shrinkfactor=0.3": 147, "img=oryx/bullet1": 148, "singleton=True": 149, "img=oryx/bullet2": 150, "boulderm": 151, "img=oryx/potion1": 152, "moving": 153, "boulder": 154, "                ": 155, "img=oryx/dirtwall": 156, "k": 157, "l": 158, "o": 159, "stype=goal": 160, "stype=boulder": 161, "   ": 162, "scoreChange=5": 163, "teleportToExit": 164, "collectResource": 165, "resource=key": 166, "value=1": 167, "killIfOtherHasMore": 168, "stype=boulderm": 169, "attractGaze": 170, "undoAll": 171, "square_size=50": 172, "img=newset/floor2": 173, "hidden=True": 174, "MovingAvatar": 175, "img=oryx/knight1": 176, "box": 177, "hole": 178, "color=DARKBLUE": 179, "img=oryx/cspell4": 180, "door": 181, "exit": 182, "img=oryx/dooropen1": 183, "0": 184, "3": 185, "*": 186, "-": 187, "a": 188, "d": 189, "e": 190, "bounceForward": 191, "killAll": 192, "scoreChange=4": 193, "stype=exit": 194, "death": 195, "ground": 196, "color=BLACK": 197, "img=oryx/backLBrown": 198, "color=WHITE": 199, "img=newset/lock1": 200, "smokespawn": 201, "RandomMissile": 202, "speed=0.25": 203, "invisible=True": 204, "img=oryx/pickaxe": 205, "shieldFrom": 206, "value=-1": 207, "img=oryx/bird1": 208, "healthPoints=5": 209, "img=oryx/tree2": 210, "img=newset/exit2": 211, "food": 212, "TIME": 213, "subtractHealthPoints": 214, "repeating=True": 215, "addHealthPoints": 216, "scoreChange=100": 217, "img=oryx/floor3": 218, "fruit": 219, "color=PINK": 220, "pellet": 221, "img=oryx/gold2": 222, "power": 223, "img=oryx/orb2": 224, "img=portal": 225, "redspawn": 226, "stype=redOk": 227, "orangespawn": 228, "stype=orangeOk": 229, "bluespawn": 230, "stype=blueOk": 231, "pinkspawn": 232, "stype=pinkOk": 233, "ghost": 234, "red": 235, "                    ": 236, "RandomPathAltChaser": 237, "stype1=hungry": 238, "stype2=powered": 239, "cooldown=4": 240, "cons=4": 241, "Fleeing": 242, "stype=pacman": 243, "maxDistance=500": 244, "img=oryx/ghost1": 245, "blue": 246, "pacman": 247, "OrientedAvatar": 248, "rotateInPlace=false": 249, "hungry": 250, "powered": 251, "           ": 252, "wrapAround": 253, "scoreChange=10": 254, "transformToAll": 255, "addTimer": 256, "timer=200": 257, "ftype=transformToAll": 258, "stype=powered": 259, "4": 260, "square_size=30": 261, "img=oryx/backBiege": 262, "base": 263, "healthPoints=20": 264, "img=newset/girl2": 265, "speed=0.4": 266, "protector": 267, "stype=missile": 268, "turn": 269, "turnleft": 270, "img=dirt": 271, "turnright": 272, "turnup": 273, "turndown": 274, "bandit": 275, "speed=1": 276, "bleftd": 277, "spawnorientation=DOWN": 278, "img=newset/bandit1h": 279, "brightu": 280, "spawnorientation=UP": 281, "img=newset/bandit1": 282, "bleftu": 283, "brightd": 284, "doorClosed1": 285, "doorClosed2": 286, "img=oryx/orb1": 287, "speed=0.6": 288, "r": 289, ",": 290, "n": 291, "_": 292, "align=True": 293, "img=newset/floor6": 294, "frameRate=8": 295, "boilingwater": 296, "rawpasta": 297, "tomato": 298, "tuna": 299, "pastainplace": 300, "sauceinplace": 301, "img=oryx/slash1": 302, "img=newset/floor4": 303, "stype=wrongplace": 304, "scared": 305, "speed=1.0": 306, "PathChaser": 307, "RandomNPC": 308, "cons=2": 309, "aux": 310, "dogtreat": 311, "entry": 312, "fence": 313, "img=oryx/spike2": 314, "street": 315, "tree": 316, "portal": 317, "cooldown=50": 318, "cooldown=100": 319, "s": 320, "jaildoor": 321, "jail": 322, "speed=0.9": 323, "boss": 324, "img=oryx/wall1": 325, "killResource=True": 326, "stype=boss": 327, "img=oryx/space1": 328, "img=newset/man3": 329, "stype=spark": 330, "trap": 331, "Spreader": 332, "limit=1500": 333, "stype=bullet": 334, "bullet": 335, "img=oryx/orb3": 336, "prob=0.1": 337, "cooldown=6": 338, "witness": 339, "cooldown=5": 340, "         ": 341, "img=newset/block3": 342, "mana": 343, "fire": 344, "img=oryx/fire1": 345, "total=1": 346, "turret": 347, "stype=bomb": 348, "bomb": 349, "img=newset/bomb": 350, "structure": 351, "img=oryx/bookDown": 352, "img=oryx/bookUp": 353, "img=oryx/floorTileOrange": 354, "sG": 355, "sF": 356, "sS": 357, "sT": 358, "sword": 359, "onground": 360, "stype=sword": 361, "img=oryx/swordman1": 362, "MissileAvatar": 363, "img=oryx/bat1": 364, "up": 365, "down": 366, "img=oryx/guard1": 367, "cons=3": 368, "cons=6": 369, "autotiling=true": 370, "gold": 371, "limit=10": 372, "chip": 373, "u": 374, "prob=1": 375, "resource=gold": 376, "ball": 377, "physicstype=CONT": 378, "wallBounce": 379, "background": 380, "img=oryx/planet": 381, "rotateInPlace=False": 382, "whiteAvatar": 383, "alien": 384, "total=10": 385, "total=5": 386, "       ": 387, "start": 388, "img=oryx/slime1": 389, "scoreChange=-5": 390, "cocoon": 391, "butterfly": 392, "cons=1": 393, "belt": 394, "lever": 395, "leverUp": 396, "leverRight": 397, "img=oryx/bookRight": 398, "leverDown": 399, "leverLeft": 400, "img=oryx/bookLeft": 401, "suitcase": 402, "img=newset/man4": 403, "\t\tdirt": 404, "\t\texitdoor": 405, "\t\tdiamond": 406, "\t\tboulder": 407, "speed=0.2": 408, "\t\tmoving": 409, "img=oryx/spelunky": 410, "dirt": 411, "diamond": 412, "crab": 413, "\t\tavatar": 414, "killIfFromAbove": 415, "\t\tSpriteCounter": 416, "emptyPlanet": 417, "\t\t": 418, "align": 419, "nokey": 420, "withkey": 421, "cooldown=8": 422, "img=newset/hole1": 423, "img=newset/block1": 424, "lasercannon": 425, "lcup": 426, "img=newset/lasercannon": 427, "stype=lup": 428, "lcdown": 429, "img=newset/lasercannon_2": 430, "stype=ldown": 431, "lcright": 432, "img=newset/lasercannon_1": 433, "stype=lright": 434, "lcleft": 435, "img=newset/lasercannon_3": 436, "stype=lleft": 437, "laser": 438, "lup": 439, "img=newset/laser1": 440, "ldown": 441, "lright": 442, "img=newset/laser1_1": 443, "lleft": 444, "stype=laser": 445, "paint": 446, "prepaint": 447, "preground": 448, "stype=box": 449, "elevator": 450, "color=DARKGRAY": 451, "gravity=1.0": 452, "friction=0.02": 453, "img=newset/cloud2": 454, "evil": 455, "goomba": 456, "coin": 457, "wallStop": 458, "G": 459, "black": 460, "white": 461, "grey": 462, "target": 463, "crate": 464, "img=oryx/bush5": 465, "inBlack": 466, "inWhite": 467, "img=newset/girl1": 468, "img=newset/girl3": 469, "block": 470, "blueblock": 471, "redblock": 472, "greenblock": 473, "bluebox": 474, "redbox": 475, "greenbox": 476, "color=GOLD": 477, "limit=11": 478, "spider": 479, "phantom": 480, "pixelPerfect=True": 481, "bomberman": 482, "bomb_10": 483, "singleton=true": 484, "wallBreak": 485, "pad": 486, "stype=pad": 487, "fireboots": 488, "img=oryx/gold1": 489, "killIfHasLess": 490, "i": 491, "boxes": 492, "             ": 493, "normalAvatar": 494, "blueAvatar": 495, "redAvatar": 496, "greenAvatar": 497, "crossing": 498, "truck": 499, "speed=0.7": 500, "input": 501, "cooldown=16": 502, "img=newset/hole4": 503, "cat": 504, "limit=20": 505, "obstacle": 506, "img=oryx/slime2": 507, "img=oryx/seaWater": 508, "catapult": 509, "southfacing": 510, "northfacing": 511, "eastfacing": 512, "westfacing": 513, "portal=true": 514, "masterBoulder": 515, "speed=0.0": 516, "mboulderm": 517, "normalBoulder": 518, "bbox": 519, "boxin": 520, "rock": 521, "breakable": 522, "assembly1": 523, "assembly2": 524, "assembly3": 525, "line": 526, "linedown": 527, "lineright": 528, "rotateInPlace=true": 529, "lcswap": 530, "img=newset/lasercannon_4": 531, "vortex": 532, "product": 533, "v": 534, "stype=lcswap": 535, "stype=lcdown": 536, "stype=lcleft": 537, "stype=lcup": 538, "stype=lcright": 539, "sky": 540, "img=newset/cursedman": 541, "prob=0.15": 542, "citizen": 543, "output": 544, "bolt": 545, "salvation": 546, "cooldown=10": 547, "torpedo": 548, "shark": 549, "arena": 550, "chef": 551, "table": 552, "inc1": 553, "inc2": 554, "collectResourceIfHeld": 555, "land": 556, "button0": 557, "patrol": 558, "mushroom": 559, "othertable": 560, "img=newset/chair1": 561, "back": 562, "left": 563, "right": 564, "singlefront": 565, "singleback": 566, "singleleft": 567, "singleright": 568, "standingavatar": 569, "leavingavatar": 570, "img=oryx/archer1": 571, "building": 572, "total=20": 573, "bleft": 574, "bright": 575, "standingcivilian": 576, "fallingcivilian": 577, "cliff": 578, "redcode": 579, "img=oryx/slime3": 580, "greencode": 581, "bluecode": 582, "green": 583, "mirror": 584, "mup": 585, "mdown": 586, "mright": 587, "mleft": 588, "transformIfCount": 589, "stypeCount=code": 590, "ladder": 591, "img=oryx/barrel1": 592, "rollingBarrel": 593, "eos": 594, "inertial": 595, "asteroid": 596, "sam": 597, "portalSlow": 598, "stype=sam": 599, "resource=shield": 600, "random": 601, "standing": 602, "fleeing": 603, "escape": 604, "car": 605, "gem": 606, "resting": 607, "monster": 608, "falling": 609, "floorV": 610, "mud": 611, "brick": 612, "pokemonAbility": 613, "ability0": 614, "pokemon": 615, "pokemon0": 616, "pokemon1": 617, "bossDragon": 618, "bossWater": 619, "bossThunder": 620, "attack": 621, "surround": 622, "portalAmmo": 623, "supply": 624, "keym": 625, "reddoor": 626, "bluedoor": 627, "greendoor": 628, "yellowdoor": 629, "gate": 630, "stratosphere": 631, "thermosphere": 632, "troposphere": 633, "satellite": 634, "cloud": 635, "tank": 636, "avatar1": 637, "stepBack=True": 638, "img=newset/laser3": 639, "log": 640, "landingpad": 641, "cannon": 642, "body": 643, "chest": 644, "head": 645, "bodyinplace": 646, "george": 647, "holedown": 648, "holeup": 649, "overgroundWall": 650, "undergroundWallHdn": 651, "overgroundEnemy": 652, "overground": 653, "underground": 654, "squarehole": 655, "roundhole": 656}, "i2w": {"0": "<pad>", "1": "<unk>", "2": "<sos>", "3": "<eos>", "4": "\n", "5": "", "6": "BasicGame", "7": "square_size=25", "8": "    ", "9": "SpriteSet", "10": "        ", "11": "floor", "12": ">", "13": "Immovable", "14": "img=oryx/backGrey", "15": "enemyground", "16": "img=newset/water", "17": "avatar", "18": " ", "19": "color=YELLOW", "20": "img=oryx/spaceship1", "21": "speed=0.15", "22": "powerblib", "23": "Passive", "24": "img=oryx/diamond3", "25": "powerblibturning", "26": "Flicker", "27": "blib", "28": "img=oryx/diamond1", "29": "enemy", "30": "Missile", "31": "cooldown=3", "32": "            ", "33": "orientation=RIGHT", "34": "orientation=LEFT", "35": "shrinkfactor=0.7", "36": "orientation=UP", "37": "orientation=DOWN", "38": "img=oryx/firedown1", "39": "Resource", "40": "color=GREEN", "41": "value=0", "42": "img=oryx/diamond2", "43": "wall", "44": "img=oryx/wall3", "45": "autotiling=True", "46": "LevelMapping", "47": "b", "48": "p", "49": "2", "50": "1", "51": ".", "52": "w", "53": "+", "54": "A", "55": "TerminationSet", "56": "SpriteCounter", "57": "     ", "58": "stype=avatar", "59": "              ", "60": "limit=0", "61": "win=False", "62": "MultiSpriteCounter", "63": "win=True", "64": "InteractionSet", "65": "killSprite", "66": "scoreChange=-10", "67": "scoreChange=1", "68": "spawnIfHasMore", "69": "limit=2", "70": "spawn", "71": "changeResource", "72": "reverseDirection", "73": "  ", "74": "img=oryx/backBlack", "75": "city", "76": "explosion", "77": "limit=5", "78": "img=oryx/circleEffect1", "79": "shrinkfactor=0.5", "80": "movable", "81": "      ", "82": "ShootAvatar", "83": "Chaser", "84": "stype=city", "85": "color=ORANGE", "86": "speed=0.1", "87": "speed=0.3", "88": "img=newset/block2", "89": "c", "90": "m", "91": "f", "92": "stepBack", "93": "killBoth", "94": "scoreChange=-1", "95": "scoreChange=2", "96": "img=oryx/backOBrown", "97": "marsh", "98": "color=BROWN", "99": "img=oryx/grass", "100": "color=RED", "101": "color=GRAY", "102": "shrinkfactor=0.75", "103": "Bomber", "104": "prob=0.05", "105": "cooldown=2", "106": "zombie", "107": "goal", "108": "Door", "109": "SpawnPoint", "110": "portal=True", "111": "prob=0.01", "112": "shovel", "113": "OrientedFlicker", "114": "color=LIGHTGRAY", "115": "stype=shovel", "116": "img=oryx/wall6", "117": "transformTo", "118": "killSecond=True", "119": "EOS", "120": "g", "121": "h", "122": "z", "123": "x", "124": "t", "125": "Timeout", "126": "limit=1000", "127": "limit=1", "128": "key_handler=Pulse", "129": "water", "130": "color=BLUE", "131": "weaponToggle1", "132": "shrinkfactor=0.6", "133": "weaponToggle2", "134": "weapon", "135": "key", "136": "shrinkfactor=0.8", "137": "img=oryx/key2", "138": "lock", "139": "img=oryx/doorclosed1", "140": "portalentry", "141": "Portal", "142": "color=LIGHTBLUE", "143": "portalexit", "144": "img=oryx/door2", "145": "missile", "146": "speed=0.5", "147": "shrinkfactor=0.3", "148": "img=oryx/bullet1", "149": "singleton=True", "150": "img=oryx/bullet2", "151": "boulderm", "152": "img=oryx/potion1", "153": "moving", "154": "boulder", "155": "                ", "156": "img=oryx/dirtwall", "157": "k", "158": "l", "159": "o", "160": "stype=goal", "161": "stype=boulder", "162": "   ", "163": "scoreChange=5", "164": "teleportToExit", "165": "collectResource", "166": "resource=key", "167": "value=1", "168": "killIfOtherHasMore", "169": "stype=boulderm", "170": "attractGaze", "171": "undoAll", "172": "square_size=50", "173": "img=newset/floor2", "174": "hidden=True", "175": "MovingAvatar", "176": "img=oryx/knight1", "177": "box", "178": "hole", "179": "color=DARKBLUE", "180": "img=oryx/cspell4", "181": "door", "182": "exit", "183": "img=oryx/dooropen1", "184": "0", "185": "3", "186": "*", "187": "-", "188": "a", "189": "d", "190": "e", "191": "bounceForward", "192": "killAll", "193": "scoreChange=4", "194": "stype=exit", "195": "death", "196": "ground", "197": "color=BLACK", "198": "img=oryx/backLBrown", "199": "color=WHITE", "200": "img=newset/lock1", "201": "smokespawn", "202": "RandomMissile", "203": "speed=0.25", "204": "invisible=True", "205": "img=oryx/pickaxe", "206": "shieldFrom", "207": "value=-1", "208": "img=oryx/bird1", "209": "healthPoints=5", "210": "img=oryx/tree2", "211": "img=newset/exit2", "212": "food", "213": "TIME", "214": "subtractHealthPoints", "215": "repeating=True", "216": "addHealthPoints", "217": "scoreChange=100", "218": "img=oryx/floor3", "219": "fruit", "220": "color=PINK", "221": "pellet", "222": "img=oryx/gold2", "223": "power", "224": "img=oryx/orb2", "225": "img=portal", "226": "redspawn", "227": "stype=redOk", "228": "orangespawn", "229": "stype=orangeOk", "230": "bluespawn", "231": "stype=blueOk", "232": "pinkspawn", "233": "stype=pinkOk", "234": "ghost", "235": "red", "236": "                    ", "237": "RandomPathAltChaser", "238": "stype1=hungry", "239": "stype2=powered", "240": "cooldown=4", "241": "cons=4", "242": "Fleeing", "243": "stype=pacman", "244": "maxDistance=500", "245": "img=oryx/ghost1", "246": "blue", "247": "pacman", "248": "OrientedAvatar", "249": "rotateInPlace=false", "250": "hungry", "251": "powered", "252": "           ", "253": "wrapAround", "254": "scoreChange=10", "255": "transformToAll", "256": "addTimer", "257": "timer=200", "258": "ftype=transformToAll", "259": "stype=powered", "260": "4", "261": "square_size=30", "262": "img=oryx/backBiege", "263": "base", "264": "healthPoints=20", "265": "img=newset/girl2", "266": "speed=0.4", "267": "protector", "268": "stype=missile", "269": "turn", "270": "turnleft", "271": "img=dirt", "272": "turnright", "273": "turnup", "274": "turndown", "275": "bandit", "276": "speed=1", "277": "bleftd", "278": "spawnorientation=DOWN", "279": "img=newset/bandit1h", "280": "brightu", "281": "spawnorientation=UP", "282": "img=newset/bandit1", "283": "bleftu", "284": "brightd", "285": "doorClosed1", "286": "doorClosed2", "287": "img=oryx/orb1", "288": "speed=0.6", "289": "r", "290": ",", "291": "n", "292": "_", "293": "align=True", "294": "img=newset/floor6", "295": "frameRate=8", "296": "boilingwater", "297": "rawpasta", "298": "tomato", "299": "tuna", "300": "pastainplace", "301": "sauceinplace", "302": "img=oryx/slash1", "303": "img=newset/floor4", "304": "stype=wrongplace", "305": "scared", "306": "speed=1.0", "307": "PathChaser", "308": "RandomNPC", "309": "cons=2", "310": "aux", "311": "dogtreat", "312": "entry", "313": "fence", "314": "img=oryx/spike2", "315": "street", "316": "tree", "317": "portal", "318": "cooldown=50", "319": "cooldown=100", "320": "s", "321": "jaildoor", "322": "jail", "323": "speed=0.9", "324": "boss", "325": "img=oryx/wall1", "326": "killResource=True", "327": "stype=boss", "328": "img=oryx/space1", "329": "img=newset/man3", "330": "stype=spark", "331": "trap", "332": "Spreader", "333": "limit=1500", "334": "stype=bullet", "335": "bullet", "336": "img=oryx/orb3", "337": "prob=0.1", "338": "cooldown=6", "339": "witness", "340": "cooldown=5", "341": "         ", "342": "img=newset/block3", "343": "mana", "344": "fire", "345": "img=oryx/fire1", "346": "total=1", "347": "turret", "348": "stype=bomb", "349": "bomb", "350": "img=newset/bomb", "351": "structure", "352": "img=oryx/bookDown", "353": "img=oryx/bookUp", "354": "img=oryx/floorTileOrange", "355": "sG", "356": "sF", "357": "sS", "358": "sT", "359": "sword", "360": "onground", "361": "stype=sword", "362": "img=oryx/swordman1", "363": "MissileAvatar", "364": "img=oryx/bat1", "365": "up", "366": "down", "367": "img=oryx/guard1", "368": "cons=3", "369": "cons=6", "370": "autotiling=true", "371": "gold", "372": "limit=10", "373": "chip", "374": "u", "375": "prob=1", "376": "resource=gold", "377": "ball", "378": "physicstype=CONT", "379": "wallBounce", "380": "background", "381": "img=oryx/planet", "382": "rotateInPlace=False", "383": "whiteAvatar", "384": "alien", "385": "total=10", "386": "total=5", "387": "       ", "388": "start", "389": "img=oryx/slime1", "390": "scoreChange=-5", "391": "cocoon", "392": "butterfly", "393": "cons=1", "394": "belt", "395": "lever", "396": "leverUp", "397": "leverRight", "398": "img=oryx/bookRight", "399": "leverDown", "400": "leverLeft", "401": "img=oryx/bookLeft", "402": "suitcase", "403": "img=newset/man4", "404": "\t\tdirt", "405": "\t\texitdoor", "406": "\t\tdiamond", "407": "\t\tboulder", "408": "speed=0.2", "409": "\t\tmoving", "410": "img=oryx/spelunky", "411": "dirt", "412": "diamond", "413": "crab", "414": "\t\tavatar", "415": "killIfFromAbove", "416": "\t\tSpriteCounter", "417": "emptyPlanet", "418": "\t\t", "419": "align", "420": "nokey", "421": "withkey", "422": "cooldown=8", "423": "img=newset/hole1", "424": "img=newset/block1", "425": "lasercannon", "426": "lcup", "427": "img=newset/lasercannon", "428": "stype=lup", "429": "lcdown", "430": "img=newset/lasercannon_2", "431": "stype=ldown", "432": "lcright", "433": "img=newset/lasercannon_1", "434": "stype=lright", "435": "lcleft", "436": "img=newset/lasercannon_3", "437": "stype=lleft", "438": "laser", "439": "lup", "440": "img=newset/laser1", "441": "ldown", "442": "lright", "443": "img=newset/laser1_1", "444": "lleft", "445": "stype=laser", "446": "paint", "447": "prepaint", "448": "preground", "449": "stype=box", "450": "elevator", "451": "color=DARKGRAY", "452": "gravity=1.0", "453": "friction=0.02", "454": "img=newset/cloud2", "455": "evil", "456": "goomba", "457": "coin", "458": "wallStop", "459": "G", "460": "black", "461": "white", "462": "grey", "463": "target", "464": "crate", "465": "img=oryx/bush5", "466": "inBlack", "467": "inWhite", "468": "img=newset/girl1", "469": "img=newset/girl3", "470": "block", "471": "blueblock", "472": "redblock", "473": "greenblock", "474": "bluebox", "475": "redbox", "476": "greenbox", "477": "color=GOLD", "478": "limit=11", "479": "spider", "480": "phantom", "481": "pixelPerfect=True", "482": "bomberman", "483": "bomb_10", "484": "singleton=true", "485": "wallBreak", "486": "pad", "487": "stype=pad", "488": "fireboots", "489": "img=oryx/gold1", "490": "killIfHasLess", "491": "i", "492": "boxes", "493": "             ", "494": "normalAvatar", "495": "blueAvatar", "496": "redAvatar", "497": "greenAvatar", "498": "crossing", "499": "truck", "500": "speed=0.7", "501": "input", "502": "cooldown=16", "503": "img=newset/hole4", "504": "cat", "505": "limit=20", "506": "obstacle", "507": "img=oryx/slime2", "508": "img=oryx/seaWater", "509": "catapult", "510": "southfacing", "511": "northfacing", "512": "eastfacing", "513": "westfacing", "514": "portal=true", "515": "masterBoulder", "516": "speed=0.0", "517": "mboulderm", "518": "normalBoulder", "519": "bbox", "520": "boxin", "521": "rock", "522": "breakable", "523": "assembly1", "524": "assembly2", "525": "assembly3", "526": "line", "527": "linedown", "528": "lineright", "529": "rotateInPlace=true", "530": "lcswap", "531": "img=newset/lasercannon_4", "532": "vortex", "533": "product", "534": "v", "535": "stype=lcswap", "536": "stype=lcdown", "537": "stype=lcleft", "538": "stype=lcup", "539": "stype=lcright", "540": "sky", "541": "img=newset/cursedman", "542": "prob=0.15", "543": "citizen", "544": "output", "545": "bolt", "546": "salvation", "547": "cooldown=10", "548": "torpedo", "549": "shark", "550": "arena", "551": "chef", "552": "table", "553": "inc1", "554": "inc2", "555": "collectResourceIfHeld", "556": "land", "557": "button0", "558": "patrol", "559": "mushroom", "560": "othertable", "561": "img=newset/chair1", "562": "back", "563": "left", "564": "right", "565": "singlefront", "566": "singleback", "567": "singleleft", "568": "singleright", "569": "standingavatar", "570": "leavingavatar", "571": "img=oryx/archer1", "572": "building", "573": "total=20", "574": "bleft", "575": "bright", "576": "standingcivilian", "577": "fallingcivilian", "578": "cliff", "579": "redcode", "580": "img=oryx/slime3", "581": "greencode", "582": "bluecode", "583": "green", "584": "mirror", "585": "mup", "586": "mdown", "587": "mright", "588": "mleft", "589": "transformIfCount", "590": "stypeCount=code", "591": "ladder", "592": "img=oryx/barrel1", "593": "rollingBarrel", "594": "eos", "595": "inertial", "596": "asteroid", "597": "sam", "598": "portalSlow", "599": "stype=sam", "600": "resource=shield", "601": "random", "602": "standing", "603": "fleeing", "604": "escape", "605": "car", "606": "gem", "607": "resting", "608": "monster", "609": "falling", "610": "floorV", "611": "mud", "612": "brick", "613": "pokemonAbility", "614": "ability0", "615": "pokemon", "616": "pokemon0", "617": "pokemon1", "618": "bossDragon", "619": "bossWater", "620": "bossThunder", "621": "attack", "622": "surround", "623": "portalAmmo", "624": "supply", "625": "keym", "626": "reddoor", "627": "bluedoor", "628": "greendoor", "629": "yellowdoor", "630": "gate", "631": "stratosphere", "632": "thermosphere", "633": "troposphere", "634": "satellite", "635": "cloud", "636": "tank", "637": "avatar1", "638": "stepBack=True", "639": "img=newset/laser3", "640": "log", "641": "landingpad", "642": "cannon", "643": "body", "644": "chest", "645": "head", "646": "bodyinplace", "647": "george", "648": "holedown", "649": "holeup", "650": "overgroundWall", "651": "undergroundWallHdn", "652": "overgroundEnemy", "653": "overground", "654": "underground", "655": "squarehole", "656": "roundhole"}}