{"w2i": {"<pad>": 0, "<unk>": 1, "<sos>": 2, "<eos>": 3, "BasicGame": 4, "square_size=25": 5, "\n": 6, "    ": 7, "SpriteSet": 8, "        ": 9, "floor": 10, ">": 11, "Immovable": 12, "img=oryx/backBiege": 13, "hidden=True": 14, "goal": 15, " ": 16, "Door": 17, "color=GREEN": 18, "img=newset/exit2": 19, "": 20, "camel": 21, "Missile": 22, "orientation=RIGHT": 23, "            ": 24, "speed=0.25": 25, "speed=0.15": 26, "singleton=True": 27, "arena": 28, "img=newset/floor6": 29, "color=LIGHTBLUE": 30, "color=LIGHTGREEN": 31, "color=LIGHTGRAY": 32, "avatar": 33, "MovingAvatar": 34, "speed=1.0": 35, "img=newset/man4": 36, "normal": 37, "wall": 38, "InteractionSet": 39, "transformTo": 40, "stepBack": 41, "pixelPerfect=True": 42, "LevelMapping": 43, "A": 44, ".": 45, "1": 46, "2": 47, "3": 48, "4": 49, "a": 50, "b": 51, "c": 52, "d": 53, "g": 54, "+": 55, "-": 56, "TerminationSet": 57, "MultiSpriteCounter": 58, "limit=2": 59, "win=True": 60, "limit=1": 61, "win=False": 62, "img=oryx/backOBrown": 63, "hole": 64, "  ": 65, "color=DARKBLUE": 66, "img=newset/hole1": 67, "portal=True": 68, "shovel": 69, "Flicker": 70, "img=oryx/pickaxe": 71, "shrinkfactor=0.5": 72, "entrance": 73, "SpawnPoint": 74, "total=20": 75, "cooldown=50": 76, "exit": 77, "img=oryx/door2": 78, "moving": 79, "ShootAvatar": 80, "stype=shovel": 81, "Chaser": 82, "stype=exit": 83, "cooldown=5": 84, "color=RED": 85, "img=oryx/spelunky": 86, "frameRate=8": 87, "shrinkfactor=0.75": 88, "img=oryx/dirtwall": 89, "autotiling=True": 90, "x": 91, "e": 92, "h": 93, "w": 94, "SpriteCounter": 95, "stype=avatar": 96, "limit=0": 97, "killSprite": 98, "scoreChange=-5": 99, "scoreChange=-2": 100, "EOS": 101, "scoreChange=-1": 102, "scoreChange=2": 103, "square_size=30": 104, "key_handler=Pulse": 105, "background": 106, "color=BLUE": 107, "img=oryx/seaWater": 108, "water": 109, "autotiling=true": 110, "img=oryx/grass": 111, "img=oryx/bush5": 112, "img=oryx/doorclosed1": 113, "cooldown=10": 114, "log": 115, "   ": 116, "speed=0.1": 117, "color=BROWN": 118, "orientation=LEFT": 119, "landingpad": 120, "speed=0.0": 121, "img=oryx/floorTileOrange": 122, "catapult": 123, "southfacing": 124, "orientation=DOWN": 125, "img=oryx/bookDown": 126, "northfacing": 127, "orientation=UP": 128, "color=ORANGE": 129, "img=oryx/bookUp": 130, "eastfacing": 131, "color=YELLOW": 132, "img=oryx/bookRight": 133, "westfacing": 134, "img=oryx/bookLeft": 135, "OrientedAvatar": 136, "                ": 137, "onground": 138, "bullet": 139, "MissileAvatar": 140, "img=oryx/bat1": 141, "0": 142, "r": 143, "l": 144, "shieldFrom": 145, "stype=water": 146, "pullWithIt": 147, "attractGaze": 148, "prob=1": 149, "align=True": 150, "scoreChange=1": 151, "       ": 152, "stype=goal": 153, "Timeout": 154, "limit=1000": 155, "img=oryx/space1": 156, "asteroid": 157, "img=oryx/planet": 158, "missile": 159, "rock": 160, "img=oryx/orb3": 161, "sam": 162, "img=oryx/orb1": 163, "laser": 164, "speed=0.3": 165, "portal": 166, "prob=0.05": 167, "img=newset/whirlpool2": 168, "Resource": 169, "color=GOLD": 170, "limit=4": 171, "img=oryx/spaceship1": 172, "rotateInPlace=False": 173, "alien": 174, "Bomber": 175, "stype=laser": 176, "prob=0.01": 177, "s": 178, "     ": 179, "killBoth": 180, "killSecond=True": 181, "changeResource": 182, "resource=shield": 183, "value=1": 184, "killResource=True": 185, "killIfHasLess": 186, "value=-1": 187, "img=newset/girl1": 188, "trap": 189, "img=oryx/spike2": 190, "img=oryx/wall1": 191, "t": 192, "RandomNPC": 193, "cons=8": 194, "speed=0.6": 195, "structure": 196, "color=PINK": 197, "left": 198, "right": 199, "n": 200, "f": 201, "m": 202, "B": 203, "pad": 204, "img=oryx/orb2": 205, "inertial": 206, "physicstype=CONT": 207, "friction=0.02": 208, "stype=pad": 209, "           ": 210, "wallStop": 211, "G": 212, "img=oryx/backLBrown": 213, "cannon": 214, "Passive": 215, "enemy": 216, "total=10": 217, "cooldown=20": 218, "total=5": 219, "img=newset/hole4": 220, "spawn": 221, "stype=bullet": 222, "      ": 223, "reverseDirection": 224, "z": 225, "v": 226, "human": 227, "img=newset/cursedman": 228, "cons=2": 229, "citizen": 230, "cons=1": 231, "george": 232, "limit=5": 233, "img=oryx/wall6": 234, "img=oryx/floor3": 235, "food": 236, "img=oryx/gold2": 237, "power": 238, "shrinkfactor=0.8": 239, "img=portal": 240, "invisible=True": 241, "img=oryx/wall3": 242, "ghost": 243, "red": 244, "                    ": 245, "RandomPathAltChaser": 246, "stype1=hungry": 247, "stype2=powered": 248, "cooldown=4": 249, "cons=4": 250, "Fleeing": 251, "stype=pacman": 252, "maxDistance=500": 253, "cooldown=2": 254, "img=oryx/ghost1": 255, "blue": 256, "pacman": 257, "rotateInPlace=false": 258, "speed=1": 259, "hungry": 260, "img=oryx/bullet1": 261, "bounceForward": 262, "undoAll": 263, "wrapAround": 264, "scoreChange=10": 265, "scoreChange=5": 266, "transformToAll": 267, "addTimer": 268, "timer=200": 269, "ftype=transformToAll": 270, "marsh": 271, "img=oryx/dooropen1": 272, "stype=sword": 273, "random": 274, "sword": 275, "weapon": 276, "shrinkfactor=0.7": 277, "gold": 278, "limit=11": 279, "collectResource": 280, "resource=gold": 281, "killIfOtherHasMore": 282, "limit=10": 283, "square_size=50": 284, "img=newset/floor2": 285, "img=oryx/knight1": 286, "box": 287, "img=newset/block2": 288, "door": 289, "*": 290, "killAll": 291, "scoreChange=4": 292, "img=oryx/backBlack": 293, "img=oryx/dirtWall": 294, "\t\tdirt": 295, "\t\texitdoor": 296, "\t\tdiamond": 297, "img=oryx/diamond3": 298, "\t\tboulder": 299, "color=GRAY": 300, "speed=0.2": 301, "\t\tmoving": 302, "dirt": 303, "boulder": 304, "diamond": 305, "crab": 306, "butterfly": 307, "\t\tavatar": 308, "killIfFromAbove": 309, "\t\tSpriteCounter": 310, "ground": 311, "img=newset/man3": 312, "Spreader": 313, "color=BLACK": 314, "limit=1500": 315, "path": 316, "turret": 317, "img=newset/lasercannon_1": 318, "img=newset/lasercannon": 319, "healthPoints=5": 320, "boss": 321, "healthPoints=10": 322, "bup": 323, "bdown": 324, "bleft": 325, "bright": 326, "stype=bleft": 327, "stype=bright": 328, "turn": 329, "turnup": 330, "img=dirt": 331, "turndown": 332, "turnleft": 333, "turnright": 334, "tower": 335, "p": 336, "u": 337, "TIME": 338, "timer=50": 339, "subtractHealthPoints": 340, "scoreChange=-10": 341, "img=oryx/backGrey": 342, "paint": 343, "prepaint": 344, "preground": 345, "spawnIfHasMore": 346, "vortex": 347, "falling": 348, "img=newset/block3": 349, "treasure": 350, "chef": 351, "table": 352, "         ": 353, "inc1": 354, "inc2": 355, "img=newset/floor4": 356, "collectResourceIfHeld": 357, "speed=0.9": 358, "pokemonAbility": 359, "ability0": 360, "stype=boss": 361, "pokemon": 362, "BomberRandomMissile": 363, "pokemon0": 364, "pokemon1": 365, "prob=0.005": 366, "bossDragon": 367, "bossWater": 368, "bossThunder": 369, "attack": 370, "img=oryx/slash1": 371, "addHealthPoints": 372, "start": 373, "dead": 374, "stype=dead": 375, "repeating=True": 376, "shrinkfactor=0.6": 377, "scared": 378, "img=oryx/tree2": 379, "gravity=0.5": 380, "speed=25": 381, "img=newset/cloud2": 382, "breakable": 383, "wallBounce": 384, "fire": 385, "sharkhole": 386, "total=1": 387, "whalehole": 388, "prob=0.1": 389, "torpedo": 390, "shrinkfactor=0.3": 391, "fish": 392, "shark": 393, "whale": 394, "base": 395, "color=WHITE": 396, "surround": 397, "bandit": 398, "cooldown=6": 399, "stype=missile": 400, "black": 401, "white": 402, "grey": 403, "target": 404, "crate": 405, "inBlack": 406, "img=newset/girl2": 407, "inWhite": 408, "img=newset/girl3": 409, "              ": 410, "city": 411, "movable": 412, "death": 413, "cooldown=100": 414, "key": 415, "img=oryx/key2": 416, "OrientedFlicker": 417, "nokey": 418, "img=oryx/swordman1": 419, "withkey": 420, "cons=6": 421, "elevator": 422, "cloud": 423, "color=DARKGRAY": 424, "evil": 425, "goomba": 426, "img=oryx/fire1": 427, "coin": 428, "img=oryx/gold1": 429, "crossing": 430, "Portal": 431, "stype=start": 432, "truck": 433, "fastRtruck": 434, "slowRtruck": 435, "speed=0.7": 436, "fastLtruck": 437, "slowLtruck": 438, "tree": 439, "input": 440, "cooldown=16": 441, "_": 442, "i": 443, "teleportToExit": 444, "gem": 445, "img=oryx/diamond1": 446, "resting": 447, "monster": 448, "speed=0.5": 449, "stype=boulder": 450, "value=0": 451, "img=oryx/cloak3": 452, "scoreChange=3": 453, "land": 454, "portGold": 455, "portGems": 456, "portDiamonds": 457, "img=oryx/diamond2": 458, "t10": 459, "t5": 460, "t1": 461, "resource=gems": 462, "resource=diamonds": 463, "bomberman": 464, "spider": 465, "bomb_10": 466, "img=newset/bomb": 467, "bomb": 468, "explosion": 469, "singleton=true": 470, "wallBreak": 471, "stype=bomb": 472, "portal=true": 473, "rotateInPlace=true": 474, "lasercannon": 475, "lcup": 476, "stype=lup": 477, "lcdown": 478, "img=newset/lasercannon_2": 479, "stype=ldown": 480, "lcright": 481, "stype=lright": 482, "lcleft": 483, "img=newset/lasercannon_3": 484, "stype=lleft": 485, "lcswap": 486, "img=newset/lasercannon_4": 487, "lup": 488, "img=newset/laser1": 489, "ldown": 490, "lright": 491, "img=newset/laser1_1": 492, "lleft": 493, "stype=lcswap": 494, "stype=lcdown": 495, "stype=lcleft": 496, "stype=lcup": 497, "stype=lcright": 498, "ball": 499, "o": 500, "value=2": 501, "img=newset/water": 502, "escape": 503, "sky": 504, "building": 505, "street": 506, "img=newset/street3": 507, "jail": 508, "standingcivilian": 509, "fallingcivilian": 510, "mushroom": 511, "k": 512, "sG": 513, "sF": 514, "sS": 515, "sT": 516, "img=oryx/guard1": 517, "cons=3": 518, "img=oryx/tombstone1": 519, "chip": 520, "block": 521, "blueblock": 522, "redblock": 523, "greenblock": 524, "bluebox": 525, "redbox": 526, "greenbox": 527, "stype=box": 528, "FlakAvatar": 529, "bubble": 530, "mud": 531, "reddoor": 532, "bluedoor": 533, "greendoor": 534, "yellowdoor": 535, "fireboots": 536, "gate": 537, "img=oryx/rogue": 538, "enemyground": 539, "powerblib": 540, "powerblibturning": 541, "blib": 542, "cooldown=3": 543, "prob=0.02": 544, "squarehole": 545, "roundhole": 546, "img=oryx/barrel1": 547, "boulderm": 548, "stype=boulderm": 549, "belt": 550, "lever": 551, "leverUp": 552, "leverRight": 553, "leverDown": 554, "leverLeft": 555, "suitcase": 556, "boxes": 557, "switch": 558, "             ": 559, "normalAvatar": 560, "blueAvatar": 561, "redAvatar": 562, "greenAvatar": 563, "img=oryx/bullet2": 564, "diver": 565, "weaponToggle1": 566, "weaponToggle2": 567, "lock": 568, "portalentry": 569, "portalexit": 570, "resource=key": 571, "masterBoulder": 572, "mboulderm": 573, "normalBoulder": 574, "keym": 575, "speed=0.4": 576, "cars": 577, "grass": 578, "highway": 579, "zombie": 580, "fastHell": 581, "slowHell": 582, "bbox": 583, "floorV": 584, "car": 585, "resources": 586, "doors": 587, "img=newset/lock1": 588, "fireEnd": 589, "invisible=true": 590, "body": 591, "chest": 592, "head": 593, "bodyinplace": 594, "stype=wrongplace": 595, "mana": 596, "output": 597, "bolt": 598, "salvation": 599, "scoreChange=100": 600, "line": 601, "virus": 602, "                 ": 603, "host": 604, "infected": 605, "doctor": 606, "mirror": 607, "img=newset/laser3": 608, "obstacle": 609, "standing": 610, "fleeing": 611, "align": 612, "snow": 613, "dog": 614, "jaildoor": 615, "phantom": 616, "assembly1": 617, "assembly2": 618, "assembly3": 619, "linedown": 620, "lineright": 621, "product": 622, "othertable": 623, "img=newset/chair1": 624, "back": 625, "singlefront": 626, "singleback": 627, "singleleft": 628, "singleright": 629, "standingavatar": 630, "leavingavatar": 631, "button0": 632, "patrol": 633, "boilingwater": 634, "rawpasta": 635, "tomato": 636, "tuna": 637, "pastainplace": 638, "sauceinplace": 639, "pipeLR": 640, "pipeUD": 641, "pipeLU": 642, "pipeLD": 643, "pipeRU": 644, "pipeRD": 645, "correct": 646, "incorrect": 647, "ballL": 648, "ballR": 649, "ballU": 650, "ballD": 651, "flip": 652, "reset": 653, "stype=ball": 654, "stype=incorrect": 655, "stype=correct": 656, "orient=False": 657, "tank": 658, "timebonus": 659, "pickaxe": 660, "breakableWall": 661, "unbreakableWall": 662, "pro": 663, "transformIfCount": 664, "geq=2": 665, "stypeCount=pro": 666, "leq=0": 667, "whiteAvatar": 668, "cat": 669, "tunnel": 670, "alientunnel": 671, "tunnelend": 672, "ladder": 673, "rollingBarrel": 674, "cliff": 675, "holedown": 676, "holeup": 677, "overgroundWall": 678, "undergroundWallHdn": 679, "overgroundEnemy": 680, "overground": 681, "underground": 682, "brick": 683}, "i2w": {"0": "<pad>", "1": "<unk>", "2": "<sos>", "3": "<eos>", "4": "BasicGame", "5": "square_size=25", "6": "\n", "7": "    ", "8": "SpriteSet", "9": "        ", "10": "floor", "11": ">", "12": "Immovable", "13": "img=oryx/backBiege", "14": "hidden=True", "15": "goal", "16": " ", "17": "Door", "18": "color=GREEN", "19": "img=newset/exit2", "20": "", "21": "camel", "22": "Missile", "23": "orientation=RIGHT", "24": "            ", "25": "speed=0.25", "26": "speed=0.15", "27": "singleton=True", "28": "arena", "29": "img=newset/floor6", "30": "color=LIGHTBLUE", "31": "color=LIGHTGREEN", "32": "color=LIGHTGRAY", "33": "avatar", "34": "MovingAvatar", "35": "speed=1.0", "36": "img=newset/man4", "37": "normal", "38": "wall", "39": "InteractionSet", "40": "transformTo", "41": "stepBack", "42": "pixelPerfect=True", "43": "LevelMapping", "44": "A", "45": ".", "46": "1", "47": "2", "48": "3", "49": "4", "50": "a", "51": "b", "52": "c", "53": "d", "54": "g", "55": "+", "56": "-", "57": "TerminationSet", "58": "MultiSpriteCounter", "59": "limit=2", "60": "win=True", "61": "limit=1", "62": "win=False", "63": "img=oryx/backOBrown", "64": "hole", "65": "  ", "66": "color=DARKBLUE", "67": "img=newset/hole1", "68": "portal=True", "69": "shovel", "70": "Flicker", "71": "img=oryx/pickaxe", "72": "shrinkfactor=0.5", "73": "entrance", "74": "SpawnPoint", "75": "total=20", "76": "cooldown=50", "77": "exit", "78": "img=oryx/door2", "79": "moving", "80": "ShootAvatar", "81": "stype=shovel", "82": "Chaser", "83": "stype=exit", "84": "cooldown=5", "85": "color=RED", "86": "img=oryx/spelunky", "87": "frameRate=8", "88": "shrinkfactor=0.75", "89": "img=oryx/dirtwall", "90": "autotiling=True", "91": "x", "92": "e", "93": "h", "94": "w", "95": "SpriteCounter", "96": "stype=avatar", "97": "limit=0", "98": "killSprite", "99": "scoreChange=-5", "100": "scoreChange=-2", "101": "EOS", "102": "scoreChange=-1", "103": "scoreChange=2", "104": "square_size=30", "105": "key_handler=Pulse", "106": "background", "107": "color=BLUE", "108": "img=oryx/seaWater", "109": "water", "110": "autotiling=true", "111": "img=oryx/grass", "112": "img=oryx/bush5", "113": "img=oryx/doorclosed1", "114": "cooldown=10", "115": "log", "116": "   ", "117": "speed=0.1", "118": "color=BROWN", "119": "orientation=LEFT", "120": "landingpad", "121": "speed=0.0", "122": "img=oryx/floorTileOrange", "123": "catapult", "124": "southfacing", "125": "orientation=DOWN", "126": "img=oryx/bookDown", "127": "northfacing", "128": "orientation=UP", "129": "color=ORANGE", "130": "img=oryx/bookUp", "131": "eastfacing", "132": "color=YELLOW", "133": "img=oryx/bookRight", "134": "westfacing", "135": "img=oryx/bookLeft", "136": "OrientedAvatar", "137": "                ", "138": "onground", "139": "bullet", "140": "MissileAvatar", "141": "img=oryx/bat1", "142": "0", "143": "r", "144": "l", "145": "shieldFrom", "146": "stype=water", "147": "pullWithIt", "148": "attractGaze", "149": "prob=1", "150": "align=True", "151": "scoreChange=1", "152": "       ", "153": "stype=goal", "154": "Timeout", "155": "limit=1000", "156": "img=oryx/space1", "157": "asteroid", "158": "img=oryx/planet", "159": "missile", "160": "rock", "161": "img=oryx/orb3", "162": "sam", "163": "img=oryx/orb1", "164": "laser", "165": "speed=0.3", "166": "portal", "167": "prob=0.05", "168": "img=newset/whirlpool2", "169": "Resource", "170": "color=GOLD", "171": "limit=4", "172": "img=oryx/spaceship1", "173": "rotateInPlace=False", "174": "alien", "175": "Bomber", "176": "stype=laser", "177": "prob=0.01", "178": "s", "179": "     ", "180": "killBoth", "181": "killSecond=True", "182": "changeResource", "183": "resource=shield", "184": "value=1", "185": "killResource=True", "186": "killIfHasLess", "187": "value=-1", "188": "img=newset/girl1", "189": "trap", "190": "img=oryx/spike2", "191": "img=oryx/wall1", "192": "t", "193": "RandomNPC", "194": "cons=8", "195": "speed=0.6", "196": "structure", "197": "color=PINK", "198": "left", "199": "right", "200": "n", "201": "f", "202": "m", "203": "B", "204": "pad", "205": "img=oryx/orb2", "206": "inertial", "207": "physicstype=CONT", "208": "friction=0.02", "209": "stype=pad", "210": "           ", "211": "wallStop", "212": "G", "213": "img=oryx/backLBrown", "214": "cannon", "215": "Passive", "216": "enemy", "217": "total=10", "218": "cooldown=20", "219": "total=5", "220": "img=newset/hole4", "221": "spawn", "222": "stype=bullet", "223": "      ", "224": "reverseDirection", "225": "z", "226": "v", "227": "human", "228": "img=newset/cursedman", "229": "cons=2", "230": "citizen", "231": "cons=1", "232": "george", "233": "limit=5", "234": "img=oryx/wall6", "235": "img=oryx/floor3", "236": "food", "237": "img=oryx/gold2", "238": "power", "239": "shrinkfactor=0.8", "240": "img=portal", "241": "invisible=True", "242": "img=oryx/wall3", "243": "ghost", "244": "red", "245": "                    ", "246": "RandomPathAltChaser", "247": "stype1=hungry", "248": "stype2=powered", "249": "cooldown=4", "250": "cons=4", "251": "Fleeing", "252": "stype=pacman", "253": "maxDistance=500", "254": "cooldown=2", "255": "img=oryx/ghost1", "256": "blue", "257": "pacman", "258": "rotateInPlace=false", "259": "speed=1", "260": "hungry", "261": "img=oryx/bullet1", "262": "bounceForward", "263": "undoAll", "264": "wrapAround", "265": "scoreChange=10", "266": "scoreChange=5", "267": "transformToAll", "268": "addTimer", "269": "timer=200", "270": "ftype=transformToAll", "271": "marsh", "272": "img=oryx/dooropen1", "273": "stype=sword", "274": "random", "275": "sword", "276": "weapon", "277": "shrinkfactor=0.7", "278": "gold", "279": "limit=11", "280": "collectResource", "281": "resource=gold", "282": "killIfOtherHasMore", "283": "limit=10", "284": "square_size=50", "285": "img=newset/floor2", "286": "img=oryx/knight1", "287": "box", "288": "img=newset/block2", "289": "door", "290": "*", "291": "killAll", "292": "scoreChange=4", "293": "img=oryx/backBlack", "294": "img=oryx/dirtWall", "295": "\t\tdirt", "296": "\t\texitdoor", "297": "\t\tdiamond", "298": "img=oryx/diamond3", "299": "\t\tboulder", "300": "color=GRAY", "301": "speed=0.2", "302": "\t\tmoving", "303": "dirt", "304": "boulder", "305": "diamond", "306": "crab", "307": "butterfly", "308": "\t\tavatar", "309": "killIfFromAbove", "310": "\t\tSpriteCounter", "311": "ground", "312": "img=newset/man3", "313": "Spreader", "314": "color=BLACK", "315": "limit=1500", "316": "path", "317": "turret", "318": "img=newset/lasercannon_1", "319": "img=newset/lasercannon", "320": "healthPoints=5", "321": "boss", "322": "healthPoints=10", "323": "bup", "324": "bdown", "325": "bleft", "326": "bright", "327": "stype=bleft", "328": "stype=bright", "329": "turn", "330": "turnup", "331": "img=dirt", "332": "turndown", "333": "turnleft", "334": "turnright", "335": "tower", "336": "p", "337": "u", "338": "TIME", "339": "timer=50", "340": "subtractHealthPoints", "341": "scoreChange=-10", "342": "img=oryx/backGrey", "343": "paint", "344": "prepaint", "345": "preground", "346": "spawnIfHasMore", "347": "vortex", "348": "falling", "349": "img=newset/block3", "350": "treasure", "351": "chef", "352": "table", "353": "         ", "354": "inc1", "355": "inc2", "356": "img=newset/floor4", "357": "collectResourceIfHeld", "358": "speed=0.9", "359": "pokemonAbility", "360": "ability0", "361": "stype=boss", "362": "pokemon", "363": "BomberRandomMissile", "364": "pokemon0", "365": "pokemon1", "366": "prob=0.005", "367": "bossDragon", "368": "bossWater", "369": "bossThunder", "370": "attack", "371": "img=oryx/slash1", "372": "addHealthPoints", "373": "start", "374": "dead", "375": "stype=dead", "376": "repeating=True", "377": "shrinkfactor=0.6", "378": "scared", "379": "img=oryx/tree2", "380": "gravity=0.5", "381": "speed=25", "382": "img=newset/cloud2", "383": "breakable", "384": "wallBounce", "385": "fire", "386": "sharkhole", "387": "total=1", "388": "whalehole", "389": "prob=0.1", "390": "torpedo", "391": "shrinkfactor=0.3", "392": "fish", "393": "shark", "394": "whale", "395": "base", "396": "color=WHITE", "397": "surround", "398": "bandit", "399": "cooldown=6", "400": "stype=missile", "401": "black", "402": "white", "403": "grey", "404": "target", "405": "crate", "406": "inBlack", "407": "img=newset/girl2", "408": "inWhite", "409": "img=newset/girl3", "410": "              ", "411": "city", "412": "movable", "413": "death", "414": "cooldown=100", "415": "key", "416": "img=oryx/key2", "417": "OrientedFlicker", "418": "nokey", "419": "img=oryx/swordman1", "420": "withkey", "421": "cons=6", "422": "elevator", "423": "cloud", "424": "color=DARKGRAY", "425": "evil", "426": "goomba", "427": "img=oryx/fire1", "428": "coin", "429": "img=oryx/gold1", "430": "crossing", "431": "Portal", "432": "stype=start", "433": "truck", "434": "fastRtruck", "435": "slowRtruck", "436": "speed=0.7", "437": "fastLtruck", "438": "slowLtruck", "439": "tree", "440": "input", "441": "cooldown=16", "442": "_", "443": "i", "444": "teleportToExit", "445": "gem", "446": "img=oryx/diamond1", "447": "resting", "448": "monster", "449": "speed=0.5", "450": "stype=boulder", "451": "value=0", "452": "img=oryx/cloak3", "453": "scoreChange=3", "454": "land", "455": "portGold", "456": "portGems", "457": "portDiamonds", "458": "img=oryx/diamond2", "459": "t10", "460": "t5", "461": "t1", "462": "resource=gems", "463": "resource=diamonds", "464": "bomberman", "465": "spider", "466": "bomb_10", "467": "img=newset/bomb", "468": "bomb", "469": "explosion", "470": "singleton=true", "471": "wallBreak", "472": "stype=bomb", "473": "portal=true", "474": "rotateInPlace=true", "475": "lasercannon", "476": "lcup", "477": "stype=lup", "478": "lcdown", "479": "img=newset/lasercannon_2", "480": "stype=ldown", "481": "lcright", "482": "stype=lright", "483": "lcleft", "484": "img=newset/lasercannon_3", "485": "stype=lleft", "486": "lcswap", "487": "img=newset/lasercannon_4", "488": "lup", "489": "img=newset/laser1", "490": "ldown", "491": "lright", "492": "img=newset/laser1_1", "493": "lleft", "494": "stype=lcswap", "495": "stype=lcdown", "496": "stype=lcleft", "497": "stype=lcup", "498": "stype=lcright", "499": "ball", "500": "o", "501": "value=2", "502": "img=newset/water", "503": "escape", "504": "sky", "505": "building", "506": "street", "507": "img=newset/street3", "508": "jail", "509": "standingcivilian", "510": "fallingcivilian", "511": "mushroom", "512": "k", "513": "sG", "514": "sF", "515": "sS", "516": "sT", "517": "img=oryx/guard1", "518": "cons=3", "519": "img=oryx/tombstone1", "520": "chip", "521": "block", "522": "blueblock", "523": "redblock", "524": "greenblock", "525": "bluebox", "526": "redbox", "527": "greenbox", "528": "stype=box", "529": "FlakAvatar", "530": "bubble", "531": "mud", "532": "reddoor", "533": "bluedoor", "534": "greendoor", "535": "yellowdoor", "536": "fireboots", "537": "gate", "538": "img=oryx/rogue", "539": "enemyground", "540": "powerblib", "541": "powerblibturning", "542": "blib", "543": "cooldown=3", "544": "prob=0.02", "545": "squarehole", "546": "roundhole", "547": "img=oryx/barrel1", "548": "boulderm", "549": "stype=boulderm", "550": "belt", "551": "lever", "552": "leverUp", "553": "leverRight", "554": "leverDown", "555": "leverLeft", "556": "suitcase", "557": "boxes", "558": "switch", "559": "             ", "560": "normalAvatar", "561": "blueAvatar", "562": "redAvatar", "563": "greenAvatar", "564": "img=oryx/bullet2", "565": "diver", "566": "weaponToggle1", "567": "weaponToggle2", "568": "lock", "569": "portalentry", "570": "portalexit", "571": "resource=key", "572": "masterBoulder", "573": "mboulderm", "574": "normalBoulder", "575": "keym", "576": "speed=0.4", "577": "cars", "578": "grass", "579": "highway", "580": "zombie", "581": "fastHell", "582": "slowHell", "583": "bbox", "584": "floorV", "585": "car", "586": "resources", "587": "doors", "588": "img=newset/lock1", "589": "fireEnd", "590": "invisible=true", "591": "body", "592": "chest", "593": "head", "594": "bodyinplace", "595": "stype=wrongplace", "596": "mana", "597": "output", "598": "bolt", "599": "salvation", "600": "scoreChange=100", "601": "line", "602": "virus", "603": "                 ", "604": "host", "605": "infected", "606": "doctor", "607": "mirror", "608": "img=newset/laser3", "609": "obstacle", "610": "standing", "611": "fleeing", "612": "align", "613": "snow", "614": "dog", "615": "jaildoor", "616": "phantom", "617": "assembly1", "618": "assembly2", "619": "assembly3", "620": "linedown", "621": "lineright", "622": "product", "623": "othertable", "624": "img=newset/chair1", "625": "back", "626": "singlefront", "627": "singleback", "628": "singleleft", "629": "singleright", "630": "standingavatar", "631": "leavingavatar", "632": "button0", "633": "patrol", "634": "boilingwater", "635": "rawpasta", "636": "tomato", "637": "tuna", "638": "pastainplace", "639": "sauceinplace", "640": "pipeLR", "641": "pipeUD", "642": "pipeLU", "643": "pipeLD", "644": "pipeRU", "645": "pipeRD", "646": "correct", "647": "incorrect", "648": "ballL", "649": "ballR", "650": "ballU", "651": "ballD", "652": "flip", "653": "reset", "654": "stype=ball", "655": "stype=incorrect", "656": "stype=correct", "657": "orient=False", "658": "tank", "659": "timebonus", "660": "pickaxe", "661": "breakableWall", "662": "unbreakableWall", "663": "pro", "664": "transformIfCount", "665": "geq=2", "666": "stypeCount=pro", "667": "leq=0", "668": "whiteAvatar", "669": "cat", "670": "tunnel", "671": "alientunnel", "672": "tunnelend", "673": "ladder", "674": "rollingBarrel", "675": "cliff", "676": "holedown", "677": "holeup", "678": "overgroundWall", "679": "undergroundWallHdn", "680": "overgroundEnemy", "681": "overground", "682": "underground", "683": "brick"}}