{"w2i": {"<pad>": 0, "<unk>": 1, "<sos>": 2, "<eos>": 3, "BasicGame": 4, "\n": 5, "    ": 6, "SpriteSet": 7, "        ": 8, "immovable0": 9, ">": 10, "Immovable": 11, "img=oryx/backOBrown": 12, "immovable1": 13, "            ": 14, "immovable2": 15, "color=BROWN": 16, "img=oryx/grass": 17, "autotiling=True": 18, "immovable3": 19, "color=RED": 20, "immovable4": 21, "color=GRAY": 22, "img=oryx/tombstone1": 23, "shrinkfactor=0.75": 24, "bomber0": 25, "Bomber": 26, "bomber1": 27, "color=GREEN": 28, "stype=missile2": 29, "prob=0.05": 30, "cooldown=2": 31, "bomber2": 32, "speed=0.1": 33, "orientation=LEFT": 34, "stype=missile1": 35, "prob=0.005": 36, "missile0": 37, "Missile": 38, "missile1": 39, "speed=0.3": 40, "missile2": 41, "orientation=RIGHT": 42, "door0": 43, "Door": 44, "img=oryx/cloak3": 45, "spawnpoint0": 46, "SpawnPoint": 47, "portal=True": 48, "stype=bomber2": 49, "spawnpoint1": 50, "prob=0.01": 51, "spawnpoint2": 52, "orientedflicker0": 53, "OrientedFlicker": 54, "limit=2": 55, "color=LIGHTGRAY": 56, "shootavatar0": 57, " ": 58, "ShootAvatar": 59, "stype=orientedflicker0": 60, "img=oryx/rogue": 61, "immovable5": 62, "img=oryx/wall6": 63, "": 64, "InteractionSet": 65, "transformTo": 66, "stype=bomber1": 67, "killSecond=True": 68, "stype=immovable3": 69, "scoreChange=-1": 70, "stype=immovable2": 71, "killBoth": 72, "scoreChange=1": 73, "killSprite": 74, "stepBack": 75, "EOS": 76, "LevelMapping": 77, "g": 78, "h": 79, "f": 80, "z": 81, "x": 82, "t": 83, "A": 84, "w": 85, ".": 86, "TerminationSet": 87, "Timeout": 88, "limit=1000": 89, "win=True": 90, "MultiSpriteCounter": 91, "stype1=immovable3": 92, "limit=1": 93, "win=False": 94, "SpriteCounter": 95, "stype=shootavatar0": 96, "limit=0": 97, "hidden=True": 98, "color=LIGHTBLUE": 99, "img=oryx/backLBlue": 100, "color=BLUE": 101, "img=oryx/seaWater": 102, "img=oryx/backGrey": 103, "randomnpc0": 104, "  ": 105, "RandomNPC": 106, "   ": 107, "color=WHITE": 108, "cons=1": 109, "orientation=DOWN": 110, "color=YELLOW": 111, "ammo=resource0": 112, "rotateInPlace=False": 113, "orientation=UP": 114, "speed=0.25": 115, "img=oryx/bullet1": 116, "img=newset/bomb": 117, "singleton=True": 118, "shrinkfactor=0.5": 119, "missile3": 120, "img=newset/cloud2": 121, "missile4": 122, "missile5": 123, "speed=0.2": 124, "missile6": 125, "missile7": 126, "cooldown=5": 127, "speed=0.6": 128, "img=oryx/dooropen1": 129, "stype=bomber0": 130, "total=20": 131, "cooldown=10": 132, "prob=0.15": 133, "missile8": 134, "img=oryx/goldsack": 135, "resource0": 136, "Resource": 137, "limit=20": 138, "c": 139, "b": 140, "a": 141, "s": 142, "p": 143, "l": 144, "d": 145, "r": 146, "e": 147, "     ": 148, "              ": 149, "stype=randomnpc0": 150, "stype2=bomber0": 151, "wall": 152, "reverseDirection": 153, "changeResource": 154, "resource=resource0": 155, "killResource=True": 156, "wrapAround": 157, "key_handler=Pulse": 158, "img=oryx/floor3": 159, "img=oryx/doorclosed1": 160, "color=DARKBLUE": 161, "img=oryx/spike2": 162, "passive0": 163, "Passive": 164, "shrinkfactor=0.8": 165, "passive1": 166, "img=newset/block2": 167, "passive2": 168, "passive3": 169, "passive4": 170, "             ": 171, "img=newset/floor6": 172, "immovable6": 173, "movingavatar0": 174, "MovingAvatar": 175, "movingavatar1": 176, "img=newset/girl3": 177, "movingavatar2": 178, "img=newset/girl2": 179, "movingavatar3": 180, "movingavatar4": 181, "img=newset/girl1": 182, "immovable7": 183, "img=oryx/wall3": 184, "1": 185, "2": 186, "3": 187, "4": 188, "bounceForward": 189, "undoAll": 190, "stype=movingavatar2": 191, "stype=movingavatar4": 192, "stype=movingavatar0": 193, "stype=door0": 194, "limit=1500": 195, "img=newset/street3": 196, "portal0": 197, "Portal": 198, "img=newset/exit2": 199, "portal1": 200, "invisible=True": 201, "parent0": 202, "                ": 203, "speed=0.9": 204, "color=ORANGE": 205, "speed=0.7": 206, "color=BLACK": 207, "img=oryx/wall1": 208, "img=oryx/tree2": 209, "stype=portal0": 210, "cooldown=16": 211, "total=1": 212, "img=newset/man4": 213, "healthPoints=5": 214, "-": 215, "_": 216, "i": 217, "+": 218, "scoreChange=10": 219, "teleportToExit": 220, "subtractHealthPoints": 221, "scoreChange=-5": 222, "spawn": 223, "img=oryx/orb2": 224, "physicstype=CONT": 225, "friction=0.02": 226, "orientedavatar0": 227, "OrientedAvatar": 228, "stype=immovable0": 229, "stype=orientedavatar0": 230, "           ": 231, "wallStop": 232, "G": 233, "square_size=50": 234, "img=oryx/backBlack": 235, "img=newset/hole1": 236, "img=oryx/bush5": 237, "img=oryx/dirtwall": 238, "B": 239, "*": 240, "u": 241, "stype=immovable4": 242, "stype=immovable5": 243, "img=oryx/key2": 244, "limit=5": 245, "img=oryx/slash1": 246, "      ": 247, "frameRate=8": 248, "shootavatar1": 249, "img=oryx/swordman1": 250, "shootavatar2": 251, "parent1": 252, "cons=6": 253, "img=oryx/bat1": 254, "randomnpc1": 255, "cooldown=4": 256, "cons=8": 257, "randomnpc2": 258, "cooldown=8": 259, "autotiling=true": 260, "       ": 261, "scoreChange=2": 262, "spaceshipavatar0": 263, "stype=missile0": 264, "speed=25": 265, "img=oryx/bullet2": 266, "img=oryx/backLBrown": 267, "img=oryx/axeman1": 268, "randommissile0": 269, "RandomMissile": 270, "chaser0": 271, "Chaser": 272, "parent2": 273, "total=10": 274, "cooldown=20": 275, "stype=chaser0": 276, "img=newset/hole5": 277, "total=5": 278, "img=newset/hole4": 279, "spawnpoint3": 280, "spawnpoint4": 281, "spawnpoint5": 282, "spawnpoint6": 283, "stype=parent1": 284, "stype=randommissile0": 285, "v": 286, "floor": 287, "none0": 288, "gravity=1.0": 289, "img=oryx/gold2": 290, "stype=immovable1": 291, "limit=11": 292, "shrinkfactor=0.6": 293, "img=newset/lock1": 294, "shrinkfactor=0.7": 295, "passive5": 296, "passive6": 297, "passive7": 298, "img=newset/floor4": 299, "o": 300, "k": 301, "scoreChange=4": 302, "collectResource": 303, "killIfOtherHasMore": 304, "stype1=immovable4": 305, "square_size=40": 306, "img=oryx/door2": 307, "img=oryx/barrel1": 308, "speed=0.5": 309, "color=PINK": 310, "0": 311, "scoreChange=5": 312, "square_size=30": 313, "ongoingshootavatar0": 314, "img=newset/camel1": 315, "                    ": 316, "missileavatar0": 317, "MissileAvatar": 318, "img=newset/camel2": 319, "speed=0.4": 320, "parent3": 321, "speed=0.8": 322, "bomberrandommissile0": 323, "BomberRandomMissile": 324, "bomberrandommissile1": 325, "prob=1": 326, "img=oryx/sparkle2": 327, "img=oryx/sparkle1": 328, "TIME": 329, "transformToAll": 330, "stype=bomberrandommissile0": 331, "addTimer": 332, "ftype=transformToAll": 333, "stype=missileavatar0": 334, "stype1=immovable2": 335, "img=oryx/backBiege": 336, "healthPoints=20": 337, "img=dirt": 338, "prob=0.4": 339, "cooldown=3": 340, "speed=1": 341, "spawnorientation=DOWN": 342, "img=newset/bandit1h": 343, "bomber3": 344, "spawnorientation=UP": 345, "img=newset/bandit1": 346, "bomber4": 347, "immovable8": 348, "door1": 349, "immovable9": 350, "immovable10": 351, "immovable11": 352, "img=oryx/orb1": 353, "door2": 354, "immovable12": 355, ",": 356, "n": 357, "attractGaze": 358, "align=True": 359, "stype=immovable7": 360, "stype=immovable9": 361, "flicker0": 362, "Flicker": 363, "img=oryx/pickaxe": 364, "stype=flicker0": 365, "shieldFrom": 366, "ftype=killSprite": 367, "stype=spawnpoint0": 368, "value=-1": 369, "img=newset/floor2": 370, "img=oryx/knight1": 371, "img=oryx/cspell4": 372, "parent4": 373, "parent5": 374, "parent6": 375, "parent7": 376, "killAll": 377, "stype=parent4": 378, "stype=parent5": 379, "stype=parent6": 380, "stype=parent7": 381, "img=newset/block3": 382, "square_size=25": 383, "img=newset/water": 384, "ongoingavatar0": 385, "img=oryx/spaceship1": 386, "speed=0.15": 387, "img=oryx/diamond3": 388, "img=oryx/diamond1": 389, "img=oryx/firedown1": 390, "value=0": 391, "limit=4": 392, "img=oryx/diamond2": 393, "scoreChange=-10": 394, "spawnIfHasMore": 395, "stype=passive1": 396, "stype=missile4": 397, "prob=0.02": 398, "stype=missile5": 399, "img=newset/block1": 400, "stype=passive2": 401, "color=DARKGRAY": 402, "wizardavatar0": 403, "walker0": 404, "killIfFromAbove": 405, "loschaser0": 406, "cons=2": 407, "img=oryx/guard1": 408, "stype=immovable6": 409, "stype1=immovable6": 410, "stype=resource1": 411, "resource1": 412, "resource2": 413, "resource3": 414, "img=newset/whirlpool2": 415, "resource4": 416, "resource=resource1": 417, "stype=parent0": 418, "resource=resource2": 419, "resource=resource3": 420, "stype=parent2": 421, "img=newset/chair1": 422, "immovable13": 423, "immovable14": 424, "immovable15": 425, "immovable16": 426, "immovable17": 427, "immovable18": 428, "img=newset/man3": 429, "stype=immovable8": 430, "img=oryx/floorTileOrange": 431, "aimedavatar0": 432, "img=newset/lasercannon_1": 433, "gravity=0.5": 434, "wallBounce": 435, "fleeing0": 436, "Fleeing": 437, "speed=1.0": 438, "img=oryx/bird1": 439, "pathchaser0": 440, "PathChaser": 441, "pathchaser1": 442, "stype=fleeing0": 443, "value=1": 444, "landeravatar0": 445, "stype=passive0": 446, "img=oryx/fire1": 447, "img=oryx/gold1": 448, "scoreChange=3": 449, "killIfHasLess": 450, "shrinkfactor=0.3": 451, "limit=10": 452, "value=2": 453, "addHealthPoints": 454, "avatar": 455, "img=oryx/space1": 456, "img=oryx/planet": 457, "flakavatar0": 458, "FlakAvatar": 459, "stype=flakavatar0": 460, "randombomber0": 461, "cooldown=50": 462, "prob=0.1": 463, "cooldown=6": 464, "img=newset/cursedman": 465, "stype1=immovable5": 466, "stype1=spawnpoint0": 467, "         ": 468, "resource5": 469, "resource6": 470, "rotateInPlace=false": 471, "5": 472, "collectResourceIfHeld": 473, "platformeravatar0": 474, "stype=missile3": 475, "img=oryx/slime2": 476, "img=oryx/slime1": 477, "color=GOLD": 478, "stype=spreader0": 479, "spreader0": 480, "Spreader": 481, "spreadprob=1.0": 482, "portal=true": 483, "invisible=true": 484, "flicker1": 485, "img=newset/lasercannon": 486, "img=newset/lasercannon_2": 487, "img=newset/lasercannon_3": 488, "stype=missile6": 489, "img=newset/lasercannon_4": 490, "img=newset/laser1": 491, "img=newset/laser1_1": 492, "healthPoints=10": 493, "m": 494, "speed=0.0": 495, "stype=parent3": 496, "rotateInPlace=true": 497, "missile9": 498, "stype=spawnpoint5": 499, "stype=spawnpoint2": 500, "stype=spawnpoint4": 501, "stype=spawnpoint1": 502, "stype=spawnpoint3": 503, "color=LIGHTGREEN": 504, "square_size=20": 505, "img=oryx/spelunky": 506, "frameRate=6": 507, "eos": 508, "stype=passive4": 509, "limitHealthPoints=20": 510, "img=oryx/circleEffect1": 511, "\t\t": 512, "align": 513, "stype=passive3": 514, "stypeTo=passive2": 515, "scoreChange=-2": 516, "scoreChange=100": 517, "stype=resource0": 518, "stype1=orientedavatar1": 519, "stype2=orientedavatar2": 520, "orientedavatar1": 521, "orientedavatar2": 522, "pixelPerfect=True": 523, "stype=orientedavatar2": 524, "img=oryx/archer1": 525, "img=newset/laser3": 526, "chaser1": 527, "stype=chaser1": 528, "missileavatar1": 529, "missileavatar2": 530, "setSpeedForAll": 531, "stepBack=True": 532, "stype=missileavatar1": 533, "stype=missileavatar2": 534, "color=LIGHTYELLOW": 535, "stype=randompathaltchaser0": 536, "stype=randompathaltchaser3": 537, "stype=randompathaltchaser1": 538, "stype=randompathaltchaser2": 539, "RandomPathAltChaser": 540, "cons=4": 541, "maxDistance=500": 542, "img=oryx/ghost1": 543, "fleeing1": 544, "fleeing2": 545, "fleeing3": 546, "timer=200": 547, "frameRate=4": 548, "frameRate=5": 549, "frameRate=7": 550, "cooldown=100": 551, "repeating=True": 552, "img=oryx/orb3": 553, "pullWithIt": 554, "platformeravatar1": 555, "resource=resource4": 556, "chaser2": 557, "chaser3": 558, "bomberrandommissile2": 559, "stype=immovable10": 560, "img=oryx/dirtWall": 561, "transformIfCount": 562, "geq=2": 563, "stypeCount=missile5": 564, "geq=1": 565, "leq=0": 566, "img=oryx/potion1": 567, "singleton=true": 568, "img=oryx/bookDown": 569, "img=oryx/bookUp": 570, "img=oryx/bookRight": 571, "img=oryx/bookLeft": 572, "img=newset/city1": 573, "\t\timmovable2": 574, "\t\tdoor0": 575, "\t\tresource0": 576, "\t\tmissile0": 577, "\t\tparent0": 578, "\t\tshootavatar0": 579, "\t\tSpriteCounter": 580, "stype=randomnpc1": 581, "orient=False": 582, "parent8": 583, "cons=3": 584, "randomnpc3": 585, "ongoingshootavatar1": 586, "ongoingshootavatar2": 587, "stype=randomnpc2": 588, "img=oryx/slime3": 589, "resource8": 590, "                 ": 591, "ongoingturningavatar0": 592, "flakavatar1": 593, "immovable19": 594, "stypeCount=immovable2": 595, "timer=50": 596}, "i2w": {"0": "<pad>", "1": "<unk>", "2": "<sos>", "3": "<eos>", "4": "BasicGame", "5": "\n", "6": "    ", "7": "SpriteSet", "8": "        ", "9": "immovable0", "10": ">", "11": "Immovable", "12": "img=oryx/backOBrown", "13": "immovable1", "14": "            ", "15": "immovable2", "16": "color=BROWN", "17": "img=oryx/grass", "18": "autotiling=True", "19": "immovable3", "20": "color=RED", "21": "immovable4", "22": "color=GRAY", "23": "img=oryx/tombstone1", "24": "shrinkfactor=0.75", "25": "bomber0", "26": "Bomber", "27": "bomber1", "28": "color=GREEN", "29": "stype=missile2", "30": "prob=0.05", "31": "cooldown=2", "32": "bomber2", "33": "speed=0.1", "34": "orientation=LEFT", "35": "stype=missile1", "36": "prob=0.005", "37": "missile0", "38": "Missile", "39": "missile1", "40": "speed=0.3", "41": "missile2", "42": "orientation=RIGHT", "43": "door0", "44": "Door", "45": "img=oryx/cloak3", "46": "spawnpoint0", "47": "SpawnPoint", "48": "portal=True", "49": "stype=bomber2", "50": "spawnpoint1", "51": "prob=0.01", "52": "spawnpoint2", "53": "orientedflicker0", "54": "OrientedFlicker", "55": "limit=2", "56": "color=LIGHTGRAY", "57": "shootavatar0", "58": " ", "59": "ShootAvatar", "60": "stype=orientedflicker0", "61": "img=oryx/rogue", "62": "immovable5", "63": "img=oryx/wall6", "64": "", "65": "InteractionSet", "66": "transformTo", "67": "stype=bomber1", "68": "killSecond=True", "69": "stype=immovable3", "70": "scoreChange=-1", "71": "stype=immovable2", "72": "killBoth", "73": "scoreChange=1", "74": "killSprite", "75": "stepBack", "76": "EOS", "77": "LevelMapping", "78": "g", "79": "h", "80": "f", "81": "z", "82": "x", "83": "t", "84": "A", "85": "w", "86": ".", "87": "TerminationSet", "88": "Timeout", "89": "limit=1000", "90": "win=True", "91": "MultiSpriteCounter", "92": "stype1=immovable3", "93": "limit=1", "94": "win=False", "95": "SpriteCounter", "96": "stype=shootavatar0", "97": "limit=0", "98": "hidden=True", "99": "color=LIGHTBLUE", "100": "img=oryx/backLBlue", "101": "color=BLUE", "102": "img=oryx/seaWater", "103": "img=oryx/backGrey", "104": "randomnpc0", "105": "  ", "106": "RandomNPC", "107": "   ", "108": "color=WHITE", "109": "cons=1", "110": "orientation=DOWN", "111": "color=YELLOW", "112": "ammo=resource0", "113": "rotateInPlace=False", "114": "orientation=UP", "115": "speed=0.25", "116": "img=oryx/bullet1", "117": "img=newset/bomb", "118": "singleton=True", "119": "shrinkfactor=0.5", "120": "missile3", "121": "img=newset/cloud2", "122": "missile4", "123": "missile5", "124": "speed=0.2", "125": "missile6", "126": "missile7", "127": "cooldown=5", "128": "speed=0.6", "129": "img=oryx/dooropen1", "130": "stype=bomber0", "131": "total=20", "132": "cooldown=10", "133": "prob=0.15", "134": "missile8", "135": "img=oryx/goldsack", "136": "resource0", "137": "Resource", "138": "limit=20", "139": "c", "140": "b", "141": "a", "142": "s", "143": "p", "144": "l", "145": "d", "146": "r", "147": "e", "148": "     ", "149": "              ", "150": "stype=randomnpc0", "151": "stype2=bomber0", "152": "wall", "153": "reverseDirection", "154": "changeResource", "155": "resource=resource0", "156": "killResource=True", "157": "wrapAround", "158": "key_handler=Pulse", "159": "img=oryx/floor3", "160": "img=oryx/doorclosed1", "161": "color=DARKBLUE", "162": "img=oryx/spike2", "163": "passive0", "164": "Passive", "165": "shrinkfactor=0.8", "166": "passive1", "167": "img=newset/block2", "168": "passive2", "169": "passive3", "170": "passive4", "171": "             ", "172": "img=newset/floor6", "173": "immovable6", "174": "movingavatar0", "175": "MovingAvatar", "176": "movingavatar1", "177": "img=newset/girl3", "178": "movingavatar2", "179": "img=newset/girl2", "180": "movingavatar3", "181": "movingavatar4", "182": "img=newset/girl1", "183": "immovable7", "184": "img=oryx/wall3", "185": "1", "186": "2", "187": "3", "188": "4", "189": "bounceForward", "190": "undoAll", "191": "stype=movingavatar2", "192": "stype=movingavatar4", "193": "stype=movingavatar0", "194": "stype=door0", "195": "limit=1500", "196": "img=newset/street3", "197": "portal0", "198": "Portal", "199": "img=newset/exit2", "200": "portal1", "201": "invisible=True", "202": "parent0", "203": "                ", "204": "speed=0.9", "205": "color=ORANGE", "206": "speed=0.7", "207": "color=BLACK", "208": "img=oryx/wall1", "209": "img=oryx/tree2", "210": "stype=portal0", "211": "cooldown=16", "212": "total=1", "213": "img=newset/man4", "214": "healthPoints=5", "215": "-", "216": "_", "217": "i", "218": "+", "219": "scoreChange=10", "220": "teleportToExit", "221": "subtractHealthPoints", "222": "scoreChange=-5", "223": "spawn", "224": "img=oryx/orb2", "225": "physicstype=CONT", "226": "friction=0.02", "227": "orientedavatar0", "228": "OrientedAvatar", "229": "stype=immovable0", "230": "stype=orientedavatar0", "231": "           ", "232": "wallStop", "233": "G", "234": "square_size=50", "235": "img=oryx/backBlack", "236": "img=newset/hole1", "237": "img=oryx/bush5", "238": "img=oryx/dirtwall", "239": "B", "240": "*", "241": "u", "242": "stype=immovable4", "243": "stype=immovable5", "244": "img=oryx/key2", "245": "limit=5", "246": "img=oryx/slash1", "247": "      ", "248": "frameRate=8", "249": "shootavatar1", "250": "img=oryx/swordman1", "251": "shootavatar2", "252": "parent1", "253": "cons=6", "254": "img=oryx/bat1", "255": "randomnpc1", "256": "cooldown=4", "257": "cons=8", "258": "randomnpc2", "259": "cooldown=8", "260": "autotiling=true", "261": "       ", "262": "scoreChange=2", "263": "spaceshipavatar0", "264": "stype=missile0", "265": "speed=25", "266": "img=oryx/bullet2", "267": "img=oryx/backLBrown", "268": "img=oryx/axeman1", "269": "randommissile0", "270": "RandomMissile", "271": "chaser0", "272": "Chaser", "273": "parent2", "274": "total=10", "275": "cooldown=20", "276": "stype=chaser0", "277": "img=newset/hole5", "278": "total=5", "279": "img=newset/hole4", "280": "spawnpoint3", "281": "spawnpoint4", "282": "spawnpoint5", "283": "spawnpoint6", "284": "stype=parent1", "285": "stype=randommissile0", "286": "v", "287": "floor", "288": "none0", "289": "gravity=1.0", "290": "img=oryx/gold2", "291": "stype=immovable1", "292": "limit=11", "293": "shrinkfactor=0.6", "294": "img=newset/lock1", "295": "shrinkfactor=0.7", "296": "passive5", "297": "passive6", "298": "passive7", "299": "img=newset/floor4", "300": "o", "301": "k", "302": "scoreChange=4", "303": "collectResource", "304": "killIfOtherHasMore", "305": "stype1=immovable4", "306": "square_size=40", "307": "img=oryx/door2", "308": "img=oryx/barrel1", "309": "speed=0.5", "310": "color=PINK", "311": "0", "312": "scoreChange=5", "313": "square_size=30", "314": "ongoingshootavatar0", "315": "img=newset/camel1", "316": "                    ", "317": "missileavatar0", "318": "MissileAvatar", "319": "img=newset/camel2", "320": "speed=0.4", "321": "parent3", "322": "speed=0.8", "323": "bomberrandommissile0", "324": "BomberRandomMissile", "325": "bomberrandommissile1", "326": "prob=1", "327": "img=oryx/sparkle2", "328": "img=oryx/sparkle1", "329": "TIME", "330": "transformToAll", "331": "stype=bomberrandommissile0", "332": "addTimer", "333": "ftype=transformToAll", "334": "stype=missileavatar0", "335": "stype1=immovable2", "336": "img=oryx/backBiege", "337": "healthPoints=20", "338": "img=dirt", "339": "prob=0.4", "340": "cooldown=3", "341": "speed=1", "342": "spawnorientation=DOWN", "343": "img=newset/bandit1h", "344": "bomber3", "345": "spawnorientation=UP", "346": "img=newset/bandit1", "347": "bomber4", "348": "immovable8", "349": "door1", "350": "immovable9", "351": "immovable10", "352": "immovable11", "353": "img=oryx/orb1", "354": "door2", "355": "immovable12", "356": ",", "357": "n", "358": "attractGaze", "359": "align=True", "360": "stype=immovable7", "361": "stype=immovable9", "362": "flicker0", "363": "Flicker", "364": "img=oryx/pickaxe", "365": "stype=flicker0", "366": "shieldFrom", "367": "ftype=killSprite", "368": "stype=spawnpoint0", "369": "value=-1", "370": "img=newset/floor2", "371": "img=oryx/knight1", "372": "img=oryx/cspell4", "373": "parent4", "374": "parent5", "375": "parent6", "376": "parent7", "377": "killAll", "378": "stype=parent4", "379": "stype=parent5", "380": "stype=parent6", "381": "stype=parent7", "382": "img=newset/block3", "383": "square_size=25", "384": "img=newset/water", "385": "ongoingavatar0", "386": "img=oryx/spaceship1", "387": "speed=0.15", "388": "img=oryx/diamond3", "389": "img=oryx/diamond1", "390": "img=oryx/firedown1", "391": "value=0", "392": "limit=4", "393": "img=oryx/diamond2", "394": "scoreChange=-10", "395": "spawnIfHasMore", "396": "stype=passive1", "397": "stype=missile4", "398": "prob=0.02", "399": "stype=missile5", "400": "img=newset/block1", "401": "stype=passive2", "402": "color=DARKGRAY", "403": "wizardavatar0", "404": "walker0", "405": "killIfFromAbove", "406": "loschaser0", "407": "cons=2", "408": "img=oryx/guard1", "409": "stype=immovable6", "410": "stype1=immovable6", "411": "stype=resource1", "412": "resource1", "413": "resource2", "414": "resource3", "415": "img=newset/whirlpool2", "416": "resource4", "417": "resource=resource1", "418": "stype=parent0", "419": "resource=resource2", "420": "resource=resource3", "421": "stype=parent2", "422": "img=newset/chair1", "423": "immovable13", "424": "immovable14", "425": "immovable15", "426": "immovable16", "427": "immovable17", "428": "immovable18", "429": "img=newset/man3", "430": "stype=immovable8", "431": "img=oryx/floorTileOrange", "432": "aimedavatar0", "433": "img=newset/lasercannon_1", "434": "gravity=0.5", "435": "wallBounce", "436": "fleeing0", "437": "Fleeing", "438": "speed=1.0", "439": "img=oryx/bird1", "440": "pathchaser0", "441": "PathChaser", "442": "pathchaser1", "443": "stype=fleeing0", "444": "value=1", "445": "landeravatar0", "446": "stype=passive0", "447": "img=oryx/fire1", "448": "img=oryx/gold1", "449": "scoreChange=3", "450": "killIfHasLess", "451": "shrinkfactor=0.3", "452": "limit=10", "453": "value=2", "454": "addHealthPoints", "455": "avatar", "456": "img=oryx/space1", "457": "img=oryx/planet", "458": "flakavatar0", "459": "FlakAvatar", "460": "stype=flakavatar0", "461": "randombomber0", "462": "cooldown=50", "463": "prob=0.1", "464": "cooldown=6", "465": "img=newset/cursedman", "466": "stype1=immovable5", "467": "stype1=spawnpoint0", "468": "         ", "469": "resource5", "470": "resource6", "471": "rotateInPlace=false", "472": "5", "473": "collectResourceIfHeld", "474": "platformeravatar0", "475": "stype=missile3", "476": "img=oryx/slime2", "477": "img=oryx/slime1", "478": "color=GOLD", "479": "stype=spreader0", "480": "spreader0", "481": "Spreader", "482": "spreadprob=1.0", "483": "portal=true", "484": "invisible=true", "485": "flicker1", "486": "img=newset/lasercannon", "487": "img=newset/lasercannon_2", "488": "img=newset/lasercannon_3", "489": "stype=missile6", "490": "img=newset/lasercannon_4", "491": "img=newset/laser1", "492": "img=newset/laser1_1", "493": "healthPoints=10", "494": "m", "495": "speed=0.0", "496": "stype=parent3", "497": "rotateInPlace=true", "498": "missile9", "499": "stype=spawnpoint5", "500": "stype=spawnpoint2", "501": "stype=spawnpoint4", "502": "stype=spawnpoint1", "503": "stype=spawnpoint3", "504": "color=LIGHTGREEN", "505": "square_size=20", "506": "img=oryx/spelunky", "507": "frameRate=6", "508": "eos", "509": "stype=passive4", "510": "limitHealthPoints=20", "511": "img=oryx/circleEffect1", "512": "\t\t", "513": "align", "514": "stype=passive3", "515": "stypeTo=passive2", "516": "scoreChange=-2", "517": "scoreChange=100", "518": "stype=resource0", "519": "stype1=orientedavatar1", "520": "stype2=orientedavatar2", "521": "orientedavatar1", "522": "orientedavatar2", "523": "pixelPerfect=True", "524": "stype=orientedavatar2", "525": "img=oryx/archer1", "526": "img=newset/laser3", "527": "chaser1", "528": "stype=chaser1", "529": "missileavatar1", "530": "missileavatar2", "531": "setSpeedForAll", "532": "stepBack=True", "533": "stype=missileavatar1", "534": "stype=missileavatar2", "535": "color=LIGHTYELLOW", "536": "stype=randompathaltchaser0", "537": "stype=randompathaltchaser3", "538": "stype=randompathaltchaser1", "539": "stype=randompathaltchaser2", "540": "RandomPathAltChaser", "541": "cons=4", "542": "maxDistance=500", "543": "img=oryx/ghost1", "544": "fleeing1", "545": "fleeing2", "546": "fleeing3", "547": "timer=200", "548": "frameRate=4", "549": "frameRate=5", "550": "frameRate=7", "551": "cooldown=100", "552": "repeating=True", "553": "img=oryx/orb3", "554": "pullWithIt", "555": "platformeravatar1", "556": "resource=resource4", "557": "chaser2", "558": "chaser3", "559": "bomberrandommissile2", "560": "stype=immovable10", "561": "img=oryx/dirtWall", "562": "transformIfCount", "563": "geq=2", "564": "stypeCount=missile5", "565": "geq=1", "566": "leq=0", "567": "img=oryx/potion1", "568": "singleton=true", "569": "img=oryx/bookDown", "570": "img=oryx/bookUp", "571": "img=oryx/bookRight", "572": "img=oryx/bookLeft", "573": "img=newset/city1", "574": "\t\timmovable2", "575": "\t\tdoor0", "576": "\t\tresource0", "577": "\t\tmissile0", "578": "\t\tparent0", "579": "\t\tshootavatar0", "580": "\t\tSpriteCounter", "581": "stype=randomnpc1", "582": "orient=False", "583": "parent8", "584": "cons=3", "585": "randomnpc3", "586": "ongoingshootavatar1", "587": "ongoingshootavatar2", "588": "stype=randomnpc2", "589": "img=oryx/slime3", "590": "resource8", "591": "                 ", "592": "ongoingturningavatar0", "593": "flakavatar1", "594": "immovable19", "595": "stypeCount=immovable2", "596": "timer=50"}}