{"w2i": {"<pad>": 0, "<unk>": 1, "<sos>": 2, "<eos>": 3, "\n": 4, "": 5, "BasicGame": 6, "square_size=25": 7, "    ": 8, "SpriteSet": 9, "        ": 10, "immovable0": 11, ">": 12, "Immovable": 13, "img=oryx/backGrey": 14, "immovable1": 15, "img=newset/water": 16, "ongoingavatar0": 17, " ": 18, "color=YELLOW": 19, "img=oryx/spaceship1": 20, "speed=0.15": 21, "passive0": 22, "Passive": 23, "img=oryx/diamond3": 24, "flicker0": 25, "Flicker": 26, "passive1": 27, "img=oryx/diamond1": 28, "missile0": 29, "Missile": 30, "cooldown=3": 31, "            ": 32, "missile1": 33, "orientation=RIGHT": 34, "missile2": 35, "orientation=LEFT": 36, "missile3": 37, "shrinkfactor=0.7": 38, "missile4": 39, "orientation=UP": 40, "missile5": 41, "orientation=DOWN": 42, "img=oryx/firedown1": 43, "resource0": 44, "Resource": 45, "color=GREEN": 46, "value=0": 47, "img=oryx/diamond2": 48, "immovable2": 49, "img=oryx/wall3": 50, "autotiling=True": 51, "LevelMapping": 52, "b": 53, "p": 54, "2": 55, "1": 56, ".": 57, "w": 58, "+": 59, "A": 60, "TerminationSet": 61, "SpriteCounter": 62, "     ": 63, "              ": 64, "limit=0": 65, "win=False": 66, "MultiSpriteCounter": 67, "win=True": 68, "InteractionSet": 69, "killSprite": 70, "scoreChange=-10": 71, "scoreChange=1": 72, "spawnIfHasMore": 73, "resource=resource0": 74, "stype=passive1": 75, "limit=2": 76, "spawn": 77, "stype=flicker0": 78, "changeResource": 79, "reverseDirection": 80, "stype=missile4": 81, "stype=missile5": 82, "  ": 83, "img=oryx/backBlack": 84, "limit=5": 85, "img=oryx/circleEffect1": 86, "shrinkfactor=0.5": 87, "parent0": 88, "      ": 89, "shootavatar0": 90, "ShootAvatar": 91, "parent1": 92, "chaser0": 93, "Chaser": 94, "stype=immovable1": 95, "color=ORANGE": 96, "speed=0.1": 97, "chaser1": 98, "speed=0.3": 99, "img=newset/block2": 100, "c": 101, "m": 102, "f": 103, "stepBack": 104, "killBoth": 105, "scoreChange=-1": 106, "scoreChange=2": 107, "stype=parent1": 108, "img=oryx/backOBrown": 109, "color=BROWN": 110, "img=oryx/grass": 111, "immovable3": 112, "color=RED": 113, "immovable4": 114, "color=GRAY": 115, "shrinkfactor=0.75": 116, "bomber0": 117, "Bomber": 118, "bomber1": 119, "stype=missile2": 120, "prob=0.05": 121, "cooldown=2": 122, "bomber2": 123, "stype=missile1": 124, "door0": 125, "Door": 126, "spawnpoint0": 127, "SpawnPoint": 128, "portal=True": 129, "stype=bomber2": 130, "spawnpoint1": 131, "prob=0.01": 132, "spawnpoint2": 133, "orientedflicker0": 134, "OrientedFlicker": 135, "color=LIGHTGRAY": 136, "stype=orientedflicker0": 137, "immovable5": 138, "img=oryx/wall6": 139, "transformTo": 140, "stype=bomber1": 141, "killSecond=True": 142, "stype=immovable3": 143, "stype=immovable2": 144, "EOS": 145, "g": 146, "h": 147, "z": 148, "x": 149, "t": 150, "Timeout": 151, "limit=1000": 152, "stype1=immovable3": 153, "limit=1": 154, "stype=shootavatar0": 155, "key_handler=Pulse": 156, "color=BLUE": 157, "shrinkfactor=0.6": 158, "resource1": 159, "shrinkfactor=0.8": 160, "img=oryx/key2": 161, "img=oryx/doorclosed1": 162, "portal0": 163, "Portal": 164, "stype=immovable5": 165, "color=LIGHTBLUE": 166, "immovable6": 167, "img=oryx/door2": 168, "speed=0.5": 169, "shrinkfactor=0.3": 170, "img=oryx/bullet1": 171, "singleton=True": 172, "img=oryx/bullet2": 173, "img=oryx/potion1": 174, "ammo=resource0": 175, "                ": 176, "shootavatar1": 177, "shootavatar2": 178, "immovable7": 179, "img=oryx/dirtwall": 180, "k": 181, "l": 182, "o": 183, "stype=immovable6": 184, "stype=passive0": 185, "   ": 186, "scoreChange=5": 187, "teleportToExit": 188, "collectResource": 189, "resource=resource1": 190, "value=1": 191, "killIfOtherHasMore": 192, "stype=missile3": 193, "attractGaze": 194, "undoAll": 195, "square_size=50": 196, "img=newset/floor2": 197, "hidden=True": 198, "movingavatar0": 199, "MovingAvatar": 200, "img=oryx/knight1": 201, "passive2": 202, "passive3": 203, "passive4": 204, "color=DARKBLUE": 205, "img=oryx/cspell4": 206, "parent2": 207, "parent3": 208, "parent4": 209, "parent5": 210, "parent6": 211, "parent7": 212, "door1": 213, "img=oryx/dooropen1": 214, "0": 215, "3": 216, "*": 217, "-": 218, "a": 219, "d": 220, "e": 221, "bounceForward": 222, "killAll": 223, "stype=parent4": 224, "stype=parent5": 225, "stype=parent6": 226, "scoreChange=4": 227, "color=BLACK": 228, "img=oryx/backLBrown": 229, "color=WHITE": 230, "img=newset/lock1": 231, "stype=randommissile0": 232, "randommissile0": 233, "RandomMissile": 234, "speed=0.25": 235, "invisible=True": 236, "img=oryx/pickaxe": 237, "shieldFrom": 238, "stype=immovable0": 239, "stype=spawnpoint0": 240, "value=-1": 241, "stype=door0": 242, "img=oryx/bird1": 243, "healthPoints=5": 244, "img=oryx/tree2": 245, "img=newset/exit2": 246, "TIME": 247, "subtractHealthPoints": 248, "repeating=True": 249, "addHealthPoints": 250, "scoreChange=100": 251, "stype=movingavatar0": 252, "img=oryx/floor3": 253, "color=PINK": 254, "img=oryx/gold2": 255, "img=oryx/orb2": 256, "stype=randompathaltchaser0": 257, "stype=randompathaltchaser3": 258, "spawnpoint3": 259, "stype=randompathaltchaser1": 260, "spawnpoint4": 261, "stype=randompathaltchaser2": 262, "                    ": 263, "RandomPathAltChaser": 264, "stype1=orientedavatar1": 265, "stype2=orientedavatar2": 266, "cooldown=4": 267, "cons=4": 268, "fleeing0": 269, "Fleeing": 270, "stype=orientedavatar0": 271, "maxDistance=500": 272, "img=oryx/ghost1": 273, "fleeing1": 274, "fleeing2": 275, "fleeing3": 276, "orientedavatar0": 277, "OrientedAvatar": 278, "rotateInPlace=false": 279, "orientedavatar1": 280, "orientedavatar2": 281, "           ": 282, "wrapAround": 283, "scoreChange=10": 284, "transformToAll": 285, "addTimer": 286, "timer=200": 287, "ftype=transformToAll": 288, "stype=orientedavatar2": 289, "4": 290, "square_size=30": 291, "img=oryx/backBiege": 292, "healthPoints=20": 293, "img=newset/girl2": 294, "speed=0.4": 295, "stype=missile0": 296, "img=dirt": 297, "speed=1": 298, "spawnorientation=DOWN": 299, "img=newset/bandit1h": 300, "bomber3": 301, "spawnorientation=UP": 302, "img=newset/bandit1": 303, "bomber4": 304, "immovable8": 305, "immovable9": 306, "immovable10": 307, "immovable11": 308, "img=oryx/orb1": 309, "speed=0.6": 310, "door2": 311, "immovable12": 312, "r": 313, ",": 314, "n": 315, "_": 316, "align=True": 317, "stype=immovable7": 318, "stype=immovable9": 319, "img=newset/floor6": 320, "frameRate=8": 321, "passive5": 322, "passive6": 323, "passive7": 324, "img=oryx/slash1": 325, "img=newset/floor4": 326, "stype=immovable4": 327, "speed=1.0": 328, "pathchaser0": 329, "PathChaser": 330, "randomnpc0": 331, "RandomNPC": 332, "cons=2": 333, "pathchaser1": 334, "img=oryx/spike2": 335, "stype=randomnpc0": 336, "cooldown=50": 337, "cooldown=100": 338, "s": 339, "speed=0.9": 340, "resource2": 341, "resource3": 342, "resource4": 343, "img=oryx/wall1": 344, "stype=resource0": 345, "resource=resource2": 346, "killResource=True": 347, "resource=resource3": 348, "resource=resource4": 349, "stype=parent2": 350, "stype=parent0": 351, "img=oryx/space1": 352, "img=newset/man3": 353, "stype=spreader0": 354, "spreader0": 355, "Spreader": 356, "limit=1500": 357, "img=oryx/orb3": 358, "prob=0.1": 359, "cooldown=6": 360, "cooldown=5": 361, "         ": 362, "img=newset/block3": 363, "img=oryx/fire1": 364, "total=1": 365, "floor": 366, "randombomber0": 367, "img=newset/bomb": 368, "img=oryx/bookDown": 369, "img=oryx/bookUp": 370, "img=oryx/floorTileOrange": 371, "img=oryx/swordman1": 372, "missileavatar0": 373, "MissileAvatar": 374, "img=oryx/bat1": 375, "missileavatar1": 376, "missileavatar2": 377, "img=oryx/guard1": 378, "randomnpc1": 379, "randomnpc2": 380, "cons=3": 381, "randomnpc3": 382, "cons=6": 383, "parent8": 384, "autotiling=true": 385, "limit=10": 386, "u": 387, "prob=1": 388, "stype=missileavatar1": 389, "stype=missileavatar2": 390, "stype=randomnpc1": 391, "physicstype=CONT": 392, "wall": 393, "wallBounce": 394, "img=oryx/planet": 395, "flakavatar0": 396, "rotateInPlace=False": 397, "flakavatar1": 398, "missile6": 399, "total=10": 400, "total=5": 401, "spawnpoint5": 402, "stype=missile6": 403, "spawnpoint6": 404, "stype=flakavatar0": 405, "stype1=spawnpoint0": 406, "stype2=bomber0": 407, "       ": 408, "img=oryx/slime1": 409, "stype=parent3": 410, "scoreChange=-5": 411, "cons=1": 412, "img=oryx/bookRight": 413, "img=oryx/bookLeft": 414, "img=newset/man4": 415, "stype=passive2": 416, "stype=passive3": 417, "stype=passive4": 418, "stypeTo=passive2": 419, "\t\timmovable2": 420, "\t\tdoor0": 421, "\t\tresource0": 422, "\t\tmissile0": 423, "speed=0.2": 424, "\t\tparent0": 425, "img=oryx/spelunky": 426, "chaser2": 427, "\t\tshootavatar0": 428, "killIfFromAbove": 429, "\t\tSpriteCounter": 430, "\t\t": 431, "align": 432, "chaser3": 433, "stype=chaser1": 434, "cooldown=8": 435, "img=newset/hole1": 436, "img=newset/block1": 437, "img=newset/lasercannon": 438, "img=newset/lasercannon_2": 439, "img=newset/lasercannon_1": 440, "img=newset/lasercannon_3": 441, "img=newset/laser1": 442, "img=newset/laser1_1": 443, "flicker1": 444, "none0": 445, "color=DARKGRAY": 446, "gravity=1.0": 447, "friction=0.02": 448, "wizardavatar0": 449, "img=newset/cloud2": 450, "walker0": 451, "wallStop": 452, "G": 453, "img=oryx/bush5": 454, "movingavatar1": 455, "movingavatar2": 456, "movingavatar3": 457, "img=newset/girl1": 458, "movingavatar4": 459, "img=newset/girl3": 460, "stype=movingavatar2": 461, "stype=movingavatar4": 462, "color=GOLD": 463, "limit=11": 464, "pixelPerfect=True": 465, "singleton=true": 466, "immovable13": 467, "stype=immovable8": 468, "landeravatar0": 469, "img=oryx/gold1": 470, "killIfHasLess": 471, "i": 472, "             ": 473, "speed=0.7": 474, "cooldown=16": 475, "stype=spawnpoint1": 476, "img=newset/hole4": 477, "limit=20": 478, "platformeravatar0": 479, "img=oryx/slime2": 480, "img=oryx/seaWater": 481, "portal=true": 482, "speed=0.0": 483, "aimedavatar0": 484, "rotateInPlace=true": 485, "img=newset/lasercannon_4": 486, "missile7": 487, "missile8": 488, "v": 489, "stype=spawnpoint5": 490, "stype=spawnpoint2": 491, "stype=spawnpoint4": 492, "stype=spawnpoint3": 493, "img=newset/cursedman": 494, "prob=0.15": 495, "cooldown=10": 496, "immovable14": 497, "stype1=immovable5": 498, "stype1=immovable6": 499, "resource5": 500, "resource6": 501, "collectResourceIfHeld": 502, "loschaser0": 503, "img=newset/chair1": 504, "immovable15": 505, "immovable16": 506, "immovable17": 507, "immovable18": 508, "img=oryx/archer1": 509, "total=20": 510, "img=oryx/slime3": 511, "immovable19": 512, "transformIfCount": 513, "stypeCount=immovable2": 514, "bomberrandommissile0": 515, "bomberrandommissile1": 516, "img=oryx/barrel1": 517, "eos": 518, "stype=bomber0": 519, "portal1": 520, "bomberrandommissile2": 521, "resource8": 522, "stepBack=True": 523, "platformeravatar1": 524, "img=newset/laser3": 525, "ongoingshootavatar1": 526, "ongoingshootavatar2": 527, "ongoingturningavatar0": 528}, "i2w": {"0": "<pad>", "1": "<unk>", "2": "<sos>", "3": "<eos>", "4": "\n", "5": "", "6": "BasicGame", "7": "square_size=25", "8": "    ", "9": "SpriteSet", "10": "        ", "11": "immovable0", "12": ">", "13": "Immovable", "14": "img=oryx/backGrey", "15": "immovable1", "16": "img=newset/water", "17": "ongoingavatar0", "18": " ", "19": "color=YELLOW", "20": "img=oryx/spaceship1", "21": "speed=0.15", "22": "passive0", "23": "Passive", "24": "img=oryx/diamond3", "25": "flicker0", "26": "Flicker", "27": "passive1", "28": "img=oryx/diamond1", "29": "missile0", "30": "Missile", "31": "cooldown=3", "32": "            ", "33": "missile1", "34": "orientation=RIGHT", "35": "missile2", "36": "orientation=LEFT", "37": "missile3", "38": "shrinkfactor=0.7", "39": "missile4", "40": "orientation=UP", "41": "missile5", "42": "orientation=DOWN", "43": "img=oryx/firedown1", "44": "resource0", "45": "Resource", "46": "color=GREEN", "47": "value=0", "48": "img=oryx/diamond2", "49": "immovable2", "50": "img=oryx/wall3", "51": "autotiling=True", "52": "LevelMapping", "53": "b", "54": "p", "55": "2", "56": "1", "57": ".", "58": "w", "59": "+", "60": "A", "61": "TerminationSet", "62": "SpriteCounter", "63": "     ", "64": "              ", "65": "limit=0", "66": "win=False", "67": "MultiSpriteCounter", "68": "win=True", "69": "InteractionSet", "70": "killSprite", "71": "scoreChange=-10", "72": "scoreChange=1", "73": "spawnIfHasMore", "74": "resource=resource0", "75": "stype=passive1", "76": "limit=2", "77": "spawn", "78": "stype=flicker0", "79": "changeResource", "80": "reverseDirection", "81": "stype=missile4", "82": "stype=missile5", "83": "  ", "84": "img=oryx/backBlack", "85": "limit=5", "86": "img=oryx/circleEffect1", "87": "shrinkfactor=0.5", "88": "parent0", "89": "      ", "90": "shootavatar0", "91": "ShootAvatar", "92": "parent1", "93": "chaser0", "94": "Chaser", "95": "stype=immovable1", "96": "color=ORANGE", "97": "speed=0.1", "98": "chaser1", "99": "speed=0.3", "100": "img=newset/block2", "101": "c", "102": "m", "103": "f", "104": "stepBack", "105": "killBoth", "106": "scoreChange=-1", "107": "scoreChange=2", "108": "stype=parent1", "109": "img=oryx/backOBrown", "110": "color=BROWN", "111": "img=oryx/grass", "112": "immovable3", "113": "color=RED", "114": "immovable4", "115": "color=GRAY", "116": "shrinkfactor=0.75", "117": "bomber0", "118": "Bomber", "119": "bomber1", "120": "stype=missile2", "121": "prob=0.05", "122": "cooldown=2", "123": "bomber2", "124": "stype=missile1", "125": "door0", "126": "Door", "127": "spawnpoint0", "128": "SpawnPoint", "129": "portal=True", "130": "stype=bomber2", "131": "spawnpoint1", "132": "prob=0.01", "133": "spawnpoint2", "134": "orientedflicker0", "135": "OrientedFlicker", "136": "color=LIGHTGRAY", "137": "stype=orientedflicker0", "138": "immovable5", "139": "img=oryx/wall6", "140": "transformTo", "141": "stype=bomber1", "142": "killSecond=True", "143": "stype=immovable3", "144": "stype=immovable2", "145": "EOS", "146": "g", "147": "h", "148": "z", "149": "x", "150": "t", "151": "Timeout", "152": "limit=1000", "153": "stype1=immovable3", "154": "limit=1", "155": "stype=shootavatar0", "156": "key_handler=Pulse", "157": "color=BLUE", "158": "shrinkfactor=0.6", "159": "resource1", "160": "shrinkfactor=0.8", "161": "img=oryx/key2", "162": "img=oryx/doorclosed1", "163": "portal0", "164": "Portal", "165": "stype=immovable5", "166": "color=LIGHTBLUE", "167": "immovable6", "168": "img=oryx/door2", "169": "speed=0.5", "170": "shrinkfactor=0.3", "171": "img=oryx/bullet1", "172": "singleton=True", "173": "img=oryx/bullet2", "174": "img=oryx/potion1", "175": "ammo=resource0", "176": "                ", "177": "shootavatar1", "178": "shootavatar2", "179": "immovable7", "180": "img=oryx/dirtwall", "181": "k", "182": "l", "183": "o", "184": "stype=immovable6", "185": "stype=passive0", "186": "   ", "187": "scoreChange=5", "188": "teleportToExit", "189": "collectResource", "190": "resource=resource1", "191": "value=1", "192": "killIfOtherHasMore", "193": "stype=missile3", "194": "attractGaze", "195": "undoAll", "196": "square_size=50", "197": "img=newset/floor2", "198": "hidden=True", "199": "movingavatar0", "200": "MovingAvatar", "201": "img=oryx/knight1", "202": "passive2", "203": "passive3", "204": "passive4", "205": "color=DARKBLUE", "206": "img=oryx/cspell4", "207": "parent2", "208": "parent3", "209": "parent4", "210": "parent5", "211": "parent6", "212": "parent7", "213": "door1", "214": "img=oryx/dooropen1", "215": "0", "216": "3", "217": "*", "218": "-", "219": "a", "220": "d", "221": "e", "222": "bounceForward", "223": "killAll", "224": "stype=parent4", "225": "stype=parent5", "226": "stype=parent6", "227": "scoreChange=4", "228": "color=BLACK", "229": "img=oryx/backLBrown", "230": "color=WHITE", "231": "img=newset/lock1", "232": "stype=randommissile0", "233": "randommissile0", "234": "RandomMissile", "235": "speed=0.25", "236": "invisible=True", "237": "img=oryx/pickaxe", "238": "shieldFrom", "239": "stype=immovable0", "240": "stype=spawnpoint0", "241": "value=-1", "242": "stype=door0", "243": "img=oryx/bird1", "244": "healthPoints=5", "245": "img=oryx/tree2", "246": "img=newset/exit2", "247": "TIME", "248": "subtractHealthPoints", "249": "repeating=True", "250": "addHealthPoints", "251": "scoreChange=100", "252": "stype=movingavatar0", "253": "img=oryx/floor3", "254": "color=PINK", "255": "img=oryx/gold2", "256": "img=oryx/orb2", "257": "stype=randompathaltchaser0", "258": "stype=randompathaltchaser3", "259": "spawnpoint3", "260": "stype=randompathaltchaser1", "261": "spawnpoint4", "262": "stype=randompathaltchaser2", "263": "                    ", "264": "RandomPathAltChaser", "265": "stype1=orientedavatar1", "266": "stype2=orientedavatar2", "267": "cooldown=4", "268": "cons=4", "269": "fleeing0", "270": "Fleeing", "271": "stype=orientedavatar0", "272": "maxDistance=500", "273": "img=oryx/ghost1", "274": "fleeing1", "275": "fleeing2", "276": "fleeing3", "277": "orientedavatar0", "278": "OrientedAvatar", "279": "rotateInPlace=false", "280": "orientedavatar1", "281": "orientedavatar2", "282": "           ", "283": "wrapAround", "284": "scoreChange=10", "285": "transformToAll", "286": "addTimer", "287": "timer=200", "288": "ftype=transformToAll", "289": "stype=orientedavatar2", "290": "4", "291": "square_size=30", "292": "img=oryx/backBiege", "293": "healthPoints=20", "294": "img=newset/girl2", "295": "speed=0.4", "296": "stype=missile0", "297": "img=dirt", "298": "speed=1", "299": "spawnorientation=DOWN", "300": "img=newset/bandit1h", "301": "bomber3", "302": "spawnorientation=UP", "303": "img=newset/bandit1", "304": "bomber4", "305": "immovable8", "306": "immovable9", "307": "immovable10", "308": "immovable11", "309": "img=oryx/orb1", "310": "speed=0.6", "311": "door2", "312": "immovable12", "313": "r", "314": ",", "315": "n", "316": "_", "317": "align=True", "318": "stype=immovable7", "319": "stype=immovable9", "320": "img=newset/floor6", "321": "frameRate=8", "322": "passive5", "323": "passive6", "324": "passive7", "325": "img=oryx/slash1", "326": "img=newset/floor4", "327": "stype=immovable4", "328": "speed=1.0", "329": "pathchaser0", "330": "PathChaser", "331": "randomnpc0", "332": "RandomNPC", "333": "cons=2", "334": "pathchaser1", "335": "img=oryx/spike2", "336": "stype=randomnpc0", "337": "cooldown=50", "338": "cooldown=100", "339": "s", "340": "speed=0.9", "341": "resource2", "342": "resource3", "343": "resource4", "344": "img=oryx/wall1", "345": "stype=resource0", "346": "resource=resource2", "347": "killResource=True", "348": "resource=resource3", "349": "resource=resource4", "350": "stype=parent2", "351": "stype=parent0", "352": "img=oryx/space1", "353": "img=newset/man3", "354": "stype=spreader0", "355": "spreader0", "356": "Spreader", "357": "limit=1500", "358": "img=oryx/orb3", "359": "prob=0.1", "360": "cooldown=6", "361": "cooldown=5", "362": "         ", "363": "img=newset/block3", "364": "img=oryx/fire1", "365": "total=1", "366": "floor", "367": "randombomber0", "368": "img=newset/bomb", "369": "img=oryx/bookDown", "370": "img=oryx/bookUp", "371": "img=oryx/floorTileOrange", "372": "img=oryx/swordman1", "373": "missileavatar0", "374": "MissileAvatar", "375": "img=oryx/bat1", "376": "missileavatar1", "377": "missileavatar2", "378": "img=oryx/guard1", "379": "randomnpc1", "380": "randomnpc2", "381": "cons=3", "382": "randomnpc3", "383": "cons=6", "384": "parent8", "385": "autotiling=true", "386": "limit=10", "387": "u", "388": "prob=1", "389": "stype=missileavatar1", "390": "stype=missileavatar2", "391": "stype=randomnpc1", "392": "physicstype=CONT", "393": "wall", "394": "wallBounce", "395": "img=oryx/planet", "396": "flakavatar0", "397": "rotateInPlace=False", "398": "flakavatar1", "399": "missile6", "400": "total=10", "401": "total=5", "402": "spawnpoint5", "403": "stype=missile6", "404": "spawnpoint6", "405": "stype=flakavatar0", "406": "stype1=spawnpoint0", "407": "stype2=bomber0", "408": "       ", "409": "img=oryx/slime1", "410": "stype=parent3", "411": "scoreChange=-5", "412": "cons=1", "413": "img=oryx/bookRight", "414": "img=oryx/bookLeft", "415": "img=newset/man4", "416": "stype=passive2", "417": "stype=passive3", "418": "stype=passive4", "419": "stypeTo=passive2", "420": "\t\timmovable2", "421": "\t\tdoor0", "422": "\t\tresource0", "423": "\t\tmissile0", "424": "speed=0.2", "425": "\t\tparent0", "426": "img=oryx/spelunky", "427": "chaser2", "428": "\t\tshootavatar0", "429": "killIfFromAbove", "430": "\t\tSpriteCounter", "431": "\t\t", "432": "align", "433": "chaser3", "434": "stype=chaser1", "435": "cooldown=8", "436": "img=newset/hole1", "437": "img=newset/block1", "438": "img=newset/lasercannon", "439": "img=newset/lasercannon_2", "440": "img=newset/lasercannon_1", "441": "img=newset/lasercannon_3", "442": "img=newset/laser1", "443": "img=newset/laser1_1", "444": "flicker1", "445": "none0", "446": "color=DARKGRAY", "447": "gravity=1.0", "448": "friction=0.02", "449": "wizardavatar0", "450": "img=newset/cloud2", "451": "walker0", "452": "wallStop", "453": "G", "454": "img=oryx/bush5", "455": "movingavatar1", "456": "movingavatar2", "457": "movingavatar3", "458": "img=newset/girl1", "459": "movingavatar4", "460": "img=newset/girl3", "461": "stype=movingavatar2", "462": "stype=movingavatar4", "463": "color=GOLD", "464": "limit=11", "465": "pixelPerfect=True", "466": "singleton=true", "467": "immovable13", "468": "stype=immovable8", "469": "landeravatar0", "470": "img=oryx/gold1", "471": "killIfHasLess", "472": "i", "473": "             ", "474": "speed=0.7", "475": "cooldown=16", "476": "stype=spawnpoint1", "477": "img=newset/hole4", "478": "limit=20", "479": "platformeravatar0", "480": "img=oryx/slime2", "481": "img=oryx/seaWater", "482": "portal=true", "483": "speed=0.0", "484": "aimedavatar0", "485": "rotateInPlace=true", "486": "img=newset/lasercannon_4", "487": "missile7", "488": "missile8", "489": "v", "490": "stype=spawnpoint5", "491": "stype=spawnpoint2", "492": "stype=spawnpoint4", "493": "stype=spawnpoint3", "494": "img=newset/cursedman", "495": "prob=0.15", "496": "cooldown=10", "497": "immovable14", "498": "stype1=immovable5", "499": "stype1=immovable6", "500": "resource5", "501": "resource6", "502": "collectResourceIfHeld", "503": "loschaser0", "504": "img=newset/chair1", "505": "immovable15", "506": "immovable16", "507": "immovable17", "508": "immovable18", "509": "img=oryx/archer1", "510": "total=20", "511": "img=oryx/slime3", "512": "immovable19", "513": "transformIfCount", "514": "stypeCount=immovable2", "515": "bomberrandommissile0", "516": "bomberrandommissile1", "517": "img=oryx/barrel1", "518": "eos", "519": "stype=bomber0", "520": "portal1", "521": "bomberrandommissile2", "522": "resource8", "523": "stepBack=True", "524": "platformeravatar1", "525": "img=newset/laser3", "526": "ongoingshootavatar1", "527": "ongoingshootavatar2", "528": "ongoingturningavatar0"}}